[{"name":"Affect Mind","level":0,"school":"E","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"Choose a target within range that isn’t hostile toward you. The target must make a Wisdom saving throw. On a failed save, you have advantage on all Charisma checks directed at that target. \nOn a successful save, the creature realizes that you tried to use the Force to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM’s discretion), depending on the nature of your interaction with it. This power has no effect on droids or constructs.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":"","concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"wis","fail":[{"type":"ieffect","name":"Afflict Mind","duration":-1,"effects":"-note \"adv on Charisma checks against this target\""}],"success":[]}]},{"type":"text","text":"The target must make a Wisdom saving throw. On a failed save, you have advantage on all Charisma checks directed at that target."}]},{"name":"Affliction","level":2,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":"Prerequisite: *Slow*"},"duration":"1 minute","ritual":false,"description":"Choose a creature that you can see within range. That creature must make a Constitution saving throw. On a failed save, the target’s speed is halved, it takes a -2 penalty to AC and Dexterity saving throws, and it can’t use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature’s abilities or items, it can’t make more than one melee or ranged attack during its turn. \nIf the creature attempts to cast a power with a casting time of 1 action, roll a d20. On an 11 or higher, the power doesn’t take effect until the creature’s next turn, and the creature must use its action on that turn to complete the power. If it can’t, the power is wasted. \nThe creatures makes another Wisdom saving throw at the end of its turn. On a successful save, the effect ends.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"ieffect","meta":[],"name":"Afflicted","duration":"10","effects":"-ac -2","end":true}],"success":[]}]},{"type":"text","meta":[],"text":"Choose a creature that you can see within range. That creature must make a Wisdom saving throw. On a failed save, the target’s speed is halved, it takes a -2 penalty to AC and Dexterity saving throws, and it can’t use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature’s abilities or items, it can’t make more than one melee or ranged attack during its turn. \nIf the creature attempts to cast a power with a casting time of 1 action, roll a d20. On an 11 or higher, the power doesn’t take effect until the creature’s next turn, and the creature must use its action on that turn to complete the power. If it can’t, the power is wasted. \nThe creatures makes another Wisdom saving throw at the end of its turn. On a successful save, the effect ends."}]},{"name":"Animate Weapon","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 bonus action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":"Prerequisite: *Force Disarm*"},"duration":"1 minute","ritual":false,"description":"You select a melee weapon you wield, or one melee weapon within range that is not worn or carried by a conscious creature, and use the Force to cause it to levitate, acting as an extension of your will for the duration or until you cast this power again. When you use this power, you can cause the weapon to move up to 20 feet and make a melee force attack against a creature within 5 feet of it. On a hit, the target takes 1d8 + your forcecasting ability modifier damage. The type is of the normal damage dealt by the weapon. \nWhile the weapon is animated, on each of your turns you can use a bonus action to move the weapon up to 20 feet and repeat the attack against a creature within 5 feet of it. At any time, you can end this force power to return the animated weapon to your hand.\nAn enemy can attempt to gain control of the weapon by making a Strength (Athletics) check against your force save DC. On a success, the creature gains control of the weapon and the power ends.","higherlevels":"When you cast this power using a force slot of 3rd level or higher, the weapon's damage increases by 1d8 for every two slot levels above the 2nd.","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"attack","meta":[],"hit":[{"type":"damage","damage":"1d8","higher":{"3":"","4":"1d8","6":"2d8","8":"3d8"}}],"miss":[]}]},{"type":"text","meta":[],"text":"When you use this power, you can cause the weapon to move up to 20 feet and make a melee force attack against a creature within 5 feet of it. On a hit, the target takes 1d8 + your forcecasting ability modier damage. The type is of the normal damage dealt by the weapon."}]},{"name":"Aura of Purity","level":4,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Self (30-foot radius)","components":{"verbal":true,"somatic":false,"material":"Prerequisite: *Restoration*"},"duration":"10 minutes","ritual":false,"description":"Purifying energy radiates from you in a 30-foot radius. Until the power ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) can’t become diseased, has resistance to poison damage, and has advantage on saving throws against effects that cause any of the following conditions: blinded, charmed, deafened, frightened, paralyzed, poisoned, and stunned.","higherlevels":"","concentration":true,"automation":[]},{"name":"Aura of Vigor","level":3,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Self (30-foot radius)","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Valor*"},"duration":"","ritual":false,"description":"Envigorating energy radiates from you in a 30-foot radius. Until the power ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) deals an extra 1d4 damage with weapon attacks.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"ieffect","meta":[],"name":"Aura of Vigor","duration":"10","effects":"-d 1d4","end":true}]},{"type":"text","meta":[],"text":"Envigorating energy radiates from you in a 30-foot radius. Until the power ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) deals an extra 1d4 damage with weapon attacks."}]},{"name":"Battle Meditation","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self (5-foot radius)","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"You exude an aura out to 5 feet that boosts the morale and overall battle prowess you and your allies while simultaneously reducing the opposition's combat effectiveness by eroding their will to fight. \nWhenever you or a friendly creature within your meditation makes an attack roll or a saving throw, they can roll a d4 and add the number rolled to the attack roll or saving throw. \nWhenever a hostile creature within your meditation makes an attack roll or saving throw, it must first make a Charisma saving throw. On a failed save, it must roll a d4 and subtract the number rolled from the attack roll or saving throw. On a successful save, it is immune to this power for 1 day.","higherlevels":"","concentration":true,"automation":[]},{"name":"Battle Precognition","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":true,"somatic":false,"material":""},"duration":"8 hours","ritual":false,"description":"Your attunement to the Force warns you when you are about to enter danger. Until the power ends, your base AC becomes 13 + your Dexterity modifier. This power has no effect if you are wearing armor.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[],"target":"self","effects":[{"type":"ieffect","meta":[],"name":"Battle Precognition","duration":"-1","effects":"-ac {dexterityMod}+13","end":false}]},{"type":"text","meta":[],"text":"Your attunement to the Force warns you when you are about to enter danger. Until the power ends, your base AC becomes 13 + your Dexterity modifier. This power has no effect if you are wearing armor."}]},{"name":"Beast Trick","level":1,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"24 hours","ritual":false,"description":"This power lets you distract a beast. Choose a beast that you can see within range. If the beast’s Intelligence is 4 or higher, the power fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the power’s duration. If you or one of your companions harms the target, the power ends.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, you can affect one additional beast for each slot level above 1st.","concentration":false,"automation":[]},{"name":"Breath Control","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":true,"somatic":false,"material":""},"duration":"10 minutes","ritual":false,"description":"You are able to slow your metabolism in such a way that you can stop breathing and resist the effect of toxins in your body. If you are poisoned, you neutralize the poison. If more than one poison afflicts you, you neutralize one poison that you know is present, or you neutralize one at random. \nFor the duration, you have advantage on saving throws against being poisoned, resistance to poison damage, and you no longer need to breathe.","higherlevels":"","concentration":false,"automation":[]},{"name":"Burst","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self (5-foot sphere)","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You cause the earth to burst from beneath your feet. Each creature within range, other than you, must succeed on a Dexterity saving throw or take 1d6 kinetic damage. \nThis power's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"1d6 [kinetic]","cantripScale":true}],"success":[]}]},{"type":"text","meta":[],"text":"You cause the earth to burst from beneath your feet. Each creature within range, other than you, must succeed on a Dexterity saving throw or take 1d6 kinetic damage. "}]},{"name":"Burst of Speed","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 hour","ritual":false,"description":"You touch a creature. The target’s speed increases by 10 feet until the power ends.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.","concentration":false,"automation":[]},{"name":"Calm Emotions","level":2,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"","range":"","components":{"verbal":false,"somatic":false,"material":""},"duration":"","ritual":false,"description":"You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. \n-You can suppress any effect causing a target to be charmed or frightened. When this power ends, any suppressed effect resumes, provided that its duration has not expired in the meantime. \n-You can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a power or if it witnesses any of its friends being harmed. \nWhen the power ends, the creature becomes hostile again, unless the DM rules otherwise.","higherlevels":"","concentration":false,"automation":[]},{"name":"Choke","level":3,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You make a constricting gesture at a creature within range. Make a ranged force attack against the target. On a hit, the target takes 5d8 force damage and must make a Constitution saving throw. On a failed save, it is also restrained until the end of your next turn.\nYou can use a bonus action while the target is restrained to move the target up to 5 feet in any direction.","higherlevels":"When you cast this power using a force slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"5d8[force]","name":"damage","higher":{"4":"1d8[force]","5":"2d8[force]","6":"3d8[force]","7":"4d8[force]","8":"5d8[force]","9":"6d8[force]"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"damage","damage":"{damage}"},{"type":"text","meta":[],"text":"The target is retrained until the end of your next turn.  As a bonus action, you may move the target up to 5 feet in any direction."}],"success":[{"type":"damage","damage":"({damage})/2"}]}]}]},{"name":"Cloud Mind","level":1,"school":"E","casttime":"1 action","range":"90 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points.\nStarting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious.  If the power ends, the sleeper takes damage, or someone uses an action wake the sleeper, they will be awoken.  \nSubtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected.\nThis power has no effect on droids or constructs.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 2nd level or higher, you can roll an additional 2d8 for each slot level above 1st.","concentration":false,"automation":[{"type":"target","target":"self","effects":[],"meta":[{"type":"roll","dice":"5d8","name":"hitpoints","higher":{"2":"2d8","3":"4d8","4":"6d8","5":"8d8","6":"10d8","7":"12d8","8":"14d8","9":"16d8"}}]},{"type":"text","text":"Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).\n\nStarting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected"}]},{"name":"Coerce Mind","level":2,"school":"E","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":"Affect Mind"},"duration":"8 hours","description":"You suggest a course of activity (limited to a sentence or two) and influence with the Force a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to harm itself automatically negates the effect of the power.\nThe target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the power ends when the subject finishes what it was asked to do.\nYou can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a soldier give her speeder to the first vagrant she meets. If the condition isn’t met before the power expires, the activity isn’t performed.\nIf you or any of your companions damage the target, the power ends. This power has no effect on droids or constructs.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"wis","fail":[{"type":"ieffect","name":"Charmed (Suggestion)","duration":-1,"effects":""}],"success":[]}]},{"type":"text","text":"The target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the power ends when the subject finishes what it was asked to do."}]},{"name":"Convulsion","level":3,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":true,"somatic":false,"material":"Tremor"},"duration":"Instantaneous","ritual":false,"description":"Choose a point you can see on the ground within range. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 kinetic damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.","higherlevels":" When you cast this power using a force slot of 4th level or higher, the damage increases by 1d12 for each slot level above 3rd.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"3d12","name":"kinetic","higher":{"4":"1d12","5":"2d12","6":"3d12","7":"4d12","8":"5d12","9":"6d12"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{kinetic} [kinetic]"}],"success":[{"type":"damage","damage":"({kinetic})/2 [kinetic]"}]}]},{"type":"text","meta":[],"text":"Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 kinetic damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared"}]},{"name":"Crush","level":6,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":"Prerequisite: *Choke*"},"duration":"Instantaneous","ritual":false,"description":"You make a crushing gesture at a creature within range. The target must make a Constitution saving throw. On a failed save target takes 10d8 force damage and is paralyzed until the end of your next turn. On a successful save, the target takes half as much damage and is not paralyzed.\nYou can use a bonus action while the target is paralyzed to move the target up to 10 feet in any direction.","higherlevels":"When you cast this power using a force slot of 7th level or higher, the damage increases by 1d8 for each slot level above 6th.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"10d8[force]","name":"damage","higher":{"7":"1d8[force]","8":"2d8[force]","9":"3d8[force]"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"damage","damage":"{damage}"},{"type":"text","meta":[],"text":"The target is paralyzed.  You can use a bonus action while the target is paralyzed to move the target up to 10 feet in any direction."}],"success":[{"type":"damage","damage":"({damage})/2"}]}]}]},{"name":"Curse","level":1,"school":"E","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":true,"material":"Denounce"},"duration":"1 minute","description":"Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the power ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw.","classes":"Dark Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a Force slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.","concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"cha","fail":[{"type":"ieffect","name":"Baned","duration":10,"effects":"-b -1d4[Bane] -sb -1d4[Bane]"}],"success":[]}]},{"type":"text","text":"Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the power ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw."}]},{"name":"Darkness","level":2,"school":"V","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"10 minutes","description":"Darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and unenhanced light can't illuminate it.\nIf the point you choose is on an object you are holding or one that isn't being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object blocks the darkness.\nIf any of this power's area overlaps with an area of light created by a power of 2nd level or lower, this power and the light are dispelled.","classes":"Dark Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":null},{"name":"Denounce","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"A target of your choice within range must make a Charisma saving throw. On a failed save, when the target makes their next attack roll or saving throw they must roll a d4 and subtract the number from it. The power then ends.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"cha","fail":[{"type":"ieffect","meta":[],"name":"Denounce","duration":"1","effects":"-b -(1d4) -sb -(1d4)","end":true}],"success":[]}]},{"type":"text","meta":[],"text":"A target of your choice within range must make a Wisdom saving throw. On a failed save, when the target makes their next attack roll or saving throw they must roll a d4 and subtract the number from it. The power then ends."}]},{"name":"Death Field","level":8,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"90 feet","components":{"verbal":true,"somatic":false,"material":"Siphon Life"},"duration":"Instantaneous","ritual":false,"description":"You draw the life force from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. A creature takes 10d8 necrotic damage on a failed save, or half as much damage on a successful one. If you reduce a hostile creature to 0, you gain temporary hit points equal to half the damage dealt. This power has no effect on droids or constructs.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"10d8","name":"necrotic"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"damage","damage":"{necrotic} [necrotic]"}],"success":[{"type":"damage","damage":"({necrotic})/2 [necrotic]"}]}]},{"type":"text","meta":[],"text":"You draw the life force from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. A creature takes 10d8 necrotic damage on a failed save, or half as much damage on a successful one. If you reduce a hostile creature to 0, you gain temporary hit points equal to half the damage dealt. This power has no effect on droids or constructs."}]},{"name":"Destroy Droid","level":7,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"120 feet (30-foot cube)","components":{"verbal":false,"somatic":false,"material":"Disable Droid"},"duration":"1 minute","ritual":false,"description":"Choose a point that you can see within range. Each droid must succeed on a Constitution saving throw or be paralyzed for the duration. At the beginning of each of its turns, the droid takes energy damage equal to twice your forcecasting ability modifier and then repeats this saving throw. On a success, the power ends on the target.","higherlevels":"","concentration":true,"automation":[]},{"name":"Disable Droid","level":4,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"90 feet (15-foot cube)","components":{"verbal":true,"somatic":false,"material":"Stun Droid"},"duration":"1 minute","ritual":false,"description":"Choose a point that you can see within range. Each droid must succeed on a Constitution saving throw or be paralyzed for the duration. At the beginning of each of its turns, the droid takes energy damage equal to your forcecasting ability modifier and then repeats this saving throw. On a success, the power ends on the target.","higherlevels":"","concentration":true,"automation":[]},{"name":"Disperse Force","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 reaction, which you take when you take cold, energy,  re, ion, lightning, or sonic damage","range":"Self","components":{"verbal":false,"somatic":false,"material":"Saber Ward"},"duration":"1 round","ritual":false,"description":"This power absorbs damage from incoming energy attacks, lessening its effect on you and distributing it throughout your body. You have resistance to the triggering damage type until the start of your next turn. Also, you gain 5 temporary hit points to potentially absorb the attack. These temporary hit points last until the start of your next turn.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, the temporary hit points increases by 5 for each slot level above 1st.","concentration":false,"automation":[]},{"name":"Dominate Beast","level":4,"school":"E","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"A beast you can see must succeed on a Wisdom save or be charmed. If you or your companions are fighting it, it has advantage on this saving throw. \nWhile it's charmed, you have a telepathic link to it if you're on the same planet. You can use this link to issue commands while you are conscious, no action required, which it does its best to obey. You can specify a simple and general course of action. If it completes the order and doesn't receive further orders, it focuses on defending itself. \nYou can use your action to take total control of the target. Until the end of your next turn, the beast takes only the actions you decide and nothing you don't allow it to. You can also have the beast use a reaction, but this takes your reaction as well. \nIf the beast takes damage, it makes another Wisdom save. On a success, the power ends.","classes":"Dark Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power with a 5th-level force slot, the duration is concentration, up to 10 minutes. When you use a 6th-level force slot, the duration is concentration, up to 1 hour. When you use a force slot of 7th level or higher, the duration is concentration, up to 8 hours.","concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"wis","fail":[{"type":"ieffect","name":"Charmed (Dominate Beast)","duration":"{time}","effects":""}],"success":[]}],"meta":[{"type":"roll","dice":"10","name":"time","higher":{"5":"-11","6":"-11","7":"-11","8":"-11","9":"-11"},"hidden":true}]},{"type":"text","text":"It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw."}]},{"name":"Dominate Monster","level":8,"school":"E","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":true,"material":"Dominate Mind"},"duration":"1 hour","description":"You attempt to beguile a creature that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.\nWhile the creature is charmed, you have a telepathic link with it as long as you are within 1 mile of it. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Attack that creature,” “Run over there,” or “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability.\nYYou can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.\nEach time the target takes damage, it makes a new Wisdom saving throw against the power. If the saving throw succeeds, the power ends.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":" When you cast this power with a 9thlevel force slot, the duration is concentration, up to 8 hours.","concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"wis","fail":[{"type":"ieffect","name":"Charmed (Dominate Monster)","duration":-1,"effects":""}],"success":[]}]},{"type":"text","text":"It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw."}]},{"name":"Drain Life","level":4,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":false,"material":"Drain Vitality"},"duration":"Instantaneous","ritual":false,"description":"You draw the life force from a creature you can see within range. The target must make a Constitution saving throw. The target takes 8d8 necrotic damage on a failed save, or half as much damage on a successful one. If you reduce a hostile creature to 0, you gain temporary hit points equal to half the damage dealt. This power has no effect on droids or constructs.","higherlevels":"When you cast this power using a force slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"8d8","name":"damage","higher":{"5":"1d8","6":"2d8","7":"3d8","8":"4d8","9":"5d8"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"damage","damage":"{damage} [necrotic]"}],"success":[{"type":"damage","damage":"({damage})/2 [necrotic]"}]}]}]},{"name":"Drain Vitality","level":2,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":"Sap Vitality"},"duration":"1 minute","ritual":false,"description":"You draw the willpower from a creature you can see within range. Make a ranged force attack against the target. On a hit, the target takes 2d6 necrotic damage and must make a Constitution saving throw. On a failed save, it deals only half damage with weapon attacks that use Strength until the power ends. \nAt the end of each of the target’s turns, it can make a Constitution saving throw against the power. On a success, the power ends.","higherlevels":"When you cast this power using a force slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.","concentration":true,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"attack","meta":[],"hit":[{"type":"damage","damage":"2d6 [necrotic]","higher":{"3":"1d6 [necrotic]","4":"2d6 [necrotic]","5":"3d6 [necrotic]","6":"4d6 [necrotic]","7":"5d6 [necrotic]","8":"6d6 [necrotic]","9":"7d6 [necrotic]"}}],"miss":[]}]}]},{"name":"Earthquake","level":8,"school":"V","casttime":"1 action","range":"500 feet","components":{"verbal":true,"somatic":true,"material":"Eruption"},"duration":"1 minute","description":"You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area.\nThe ground in the area becomes difficult terrain. Each creature on the ground that is concentrating must make a Constitution saving throw. On a failed save, the creature's concentration is broken.\nWhen you cast this power and at the end of each turn you spend concentrating on it, each creature on the ground in the area must make a Dexterity saving throw. On a failed save, the creature is knocked prone.\nThis power can have additional effects depending on the terrain in the area, as determined by the DM.\n**Fissures**: Fissures open throughout the power's area at the start of your next turn after you cast the power. A total of 1d6 such fissures open in locations chosen by the DM. Each is 1d10 × 10 feet deep, 10 feet wide, and extends from one edge of the spell's area to the opposite side. A creature standing on a spot where a fissure opens must succeed on a Dexterity saving throw or fall in. A creature that successfully saves moves with the fissure's edge as it opens.\nA fissure that opens beneath a structure causes it to automatically collapse (see below).\n**Structures**: The tremor deals 50 bludgeoning damage to any structure in contact with the ground in the area when you cast the power and at the start of each of your turns until the power ends. If a structure drops to 0 hit points, it collapses and potentially damages nearby creatures. A creature within half the distance of a structure's height must make a Dexterity saving throw. On a failed save, the creature takes 5d6 bludgeoning damage, is knocked prone, and is buried in the rubble, requiring a DC 20 Strength (Athletics) check as an action to escape. The DM can adjust the DC higher or lower, depending on the nature of the rubble. On a successful save, the creature takes half as much damage and doesn't fall prone or become buried.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"dex","fail":[{"type":"ieffect","name":"Prone (Earthquake)","duration":-1,"effects":""}],"success":[]}]},{"type":"text","text":"You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area."}]},{"name":"Enfeeble","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"Dark energy courses from your hand at a creature within range. The target must succeed on a Wisdom saving throw. If it's is missing any hit points, it takes 1d12 necrotic damage. Otherwise, it takes 1d8. The power's damage increases by one die when you reach 5th, 11th, and 17th level.","higherlevels":"","concentration":false,"automation":[]},{"name":"Eruption","level":6,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":true,"material":"Convulsion"},"duration":"Instantaneous","ritual":false,"description":"You cause up to six pillars of stone to burst from places on the ground that you can see within range. Each pillar is a cylinder that has a diameter of 5 feet and a height of up to 30 feet. The ground where a pillar appears must be wide enough for its diameter, and you can target the ground under a creature if that creature is Medium or smaller. Each pillar has AC 5 and 30 hit points. When reduced to 0 hit points, a pillar crumbles into rubble, which creates an area of difficult terrain with a 10 - foot radius that lasts until the rubble is cleared. Each 5-foot-diameter portion of the area requires at least 1 minute to clear by hand. \nIf a pillar is created under a creature, that creature must succeed on a Dexterity saving throw or be lifted by the pillar. A creature can choose to fail the save. \nIf a pillar is prevented from reaching its full height because of a ceiling or other obstacle, a creature on the pillar takes 6d6 kinetic damage and is restrained, pinched between the pillar and the obstacle. The restrained creature can use an action to make a Strength or Dexterity check (the creature’s choice) against the power’s save DC. On a success, the creature is no longer restrained and must either move off the pillar or fall off it.","higherlevels":"When you cast this power using a force slot of 7th level or higher, you can create two additional pillars for each slot level above 6th.","concentration":false,"automation":[]},{"name":"Fear","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"You awaken the sense of mortality in one creature you can see within range. The target must succeed on a Wisdom saving throw or become frightened for the duration. A target with 25 hit points or fewer makes the saving throw with disadvantage. This power has no effect on constructs or droids.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[],"success":[{"type":"ieffect","meta":[],"name":"Frightened","duration":"10","effects":"","end":true},{"type":"text","meta":[],"text":"You awaken the sense of mortality in one creature you can see within range. The target must succeed on a Wisdom saving throw or become frightened for the duration. A target with 25 hit points or fewer makes the saving throw with disadvantage. This power has no effect on constructs or droids."}]}]}]},{"name":"Feedback","level":0,"school":"E","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"Instantaneous","description":"You unleash a burst of psychic energy at a target within range. If the target can hear you (though it need not understand you), it must succeed on a Intelligence saving throw or take 1d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn.\nThis spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).","classes":"Dark Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"int","fail":[{"type":"damage","damage":"{damage}"},{"type":"ieffect","name":"Vicious Mockery","duration":0,"effects":""}],"success":[]}],"meta":[{"type":"roll","dice":"1d4[psychic]","name":"damage","cantripScale":true}]},{"type":"text","text":"If the target can hear you (thought it need not understand you), it must succeed on a Wisdom saving throw or take 1d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn."}]},{"name":"Force Barrier","level":2,"school":"A","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"8 hours","description":"This power bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 3rd level or higher, a target's hit points increase by an additional 5 for each slot level above 2nd.","concentration":false,"automation":[{"type":"target","target":"all","effects":[{"type":"damage","damage":"-{heal}[heal]"},{"type":"ieffect","name":"Max HP Increased (Aid)","duration":-1,"effects":""}],"meta":[{"type":"roll","dice":"5","name":"heal","higher":{"3":"5","4":"10","5":"15","6":"20","7":"25","8":"30","9":"35"}}]},{"type":"text","text":"Targets hit point maximum and current hit points increase by 5 for the duration."}]},{"name":"Force Blind/Deafen","level":2,"school":"N","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 minute","description":"You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the power ends.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.","concentration":false,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"con","fail":[{"type":"ieffect","name":"Blindness/Deafness","duration":10,"effects":""}],"success":[]}]},{"type":"text","text":"Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw.\nAt the end of each of its turns, the target can make a Constitution saving throw. On a success, the power ends."}]},{"name":"Force Body","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 hour","ritual":false,"description":"This power enables you to use your health to fuel your force powers. For the duration, when you cast a force power, half the cost is paid by your force points (rounded up) and half the cost is paid by your health points (rounded down). You may end this effect at any time. If you cast a force power that would reduce your hit points to 0, the power automatically fails and this effect ends.","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Breach","level":5,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"120 feet (20-foot cube)","components":{"verbal":true,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"Choose a spot within range. All force powers of 5th level or lower in the area end. For each force power of 6th level or higher in the area, make an ability check using your forcecasting ability. The DC equals 10 + the power’s level. On a successful check, the force power ends.","higherlevels":"When you cast this power using a force slot of 6th level or higher, you automatically end the effects of a force power on the target if the power’s level is equal to or less than the level of the force slot you used.","concentration":false,"automation":[]},{"name":"Force Camouflage","level":2,"school":"I","casttime":"1 action","range":"Self","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"You become invisible until the power ends. Anything you are wearing or carrying is invisible as long as it is on your person. The power ends if you attack or cast a power","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":"When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.","concentration":true,"automation":[{"type":"target","target":"self","effects":[{"type":"ieffect","name":"Invisible","duration":"10","effects":"","end":true}]},{"type":"text","text":"You become invisible until the power ends. Anything you are wearing or carrying is invisible as long as it is on your person. The power ends if you attack or cast a power."}]},{"name":"Force Chain Lightning","level":6,"school":"V","casttime":"1 action","range":"150 feet","components":{"verbal":true,"somatic":true,"material":"Force Lightning"},"duration":"Instantaneous","description":"You create a bolt of lightning that arcs toward a target of your choice that you can see within range. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts.\nA target must make a Dexterity saving throw. The target takes 10d8 lightning damage on a failed save, or half as much damage on a successful one.","classes":"Dark Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 7th level or higher, one additional bolt leaps from the first target to another target for each slot level above 6th.","concentration":false,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"dex","fail":[{"type":"damage","damage":"{damage}"}],"success":[{"type":"damage","damage":"({damage})/2"}]}],"meta":[{"type":"roll","dice":"10d8[lightning]","name":"damage"}]},{"type":"text","text":"You create a bolt of lightning that arcs toward a target of your choice that you can see within range. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts.\n\nA target must make a Dexterity saving throw. The target takes 10d8 lightning damage on a failed save, or half as much damage on a successful one."}]},{"name":"Force Confusion","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":true,"somatic":false,"material":"Mind Trick"},"duration":"1 minute","ritual":false,"description":"One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. \nThe target can act normally on its turn if you choose no creature or if none are within its reach. \nOn your subsequent turns, you must use your action to maintain control over the target, or the power ends. Also, the target can make a Wisdom saving throw at the end of each of its turns. On a success, the power ends.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[{"type":"ieffect","meta":[],"name":"Charmed","duration":"10","effects":"","end":true},{"type":"text","meta":[],"text":"One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. \nThe target can act normally on its turn if you choose no creature or if none are within its reach."}],"success":[]}]}]},{"name":"Force Disarm","level":0,"school":"A","classes":"Universal","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You select a weapon being worn or carried by a Large or smaller creature within range. The creature must make a Strength or Dexterity saving throw (the creature chooses the ability to use). If the item is being worn, this save is made with disadvantage. On a failed save, the creature takes 1d4 force damage and the item is pulled directly to you. If you have a free hand, you catch the weapon. Otherwise, it lands at your feet. \nThis power's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Enlightenment","level":2,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Guidance*"},"duration":"1 hour","ritual":false,"description":"You touch a creature and enhance it with the Force. Choose one of the following effects; the target gains that effect until the power ends. \n**Endurance.**  The target has advantage on Constitution checks. It also gains 2d6 temporary hit points, which are lost when the power ends. \n**Strength.**  The target has advantage on Strength checks, and his or her carrying capacity doubles. \n**Dexterity.**  The target has advantage on Dexterity checks. It also doesn’t take damage from falling 20 feet or less if it isn’t incapacitated. \n**Splendor.**  The target has advantage on Charisma checks. Cunning.  The target has advantage on Intelligence checks. \n**Wisdom.**  The target has advantage on Wisdom checks.","higherlevels":"When you cast this power using a force slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.","concentration":true,"automation":[]},{"name":"Force Immunity","level":4,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 minute","ritual":false,"description":"An immobile, faintly shimmering barrier springs into existence around you and remains for the duration. The barrier moves with you.\nAny force power of 3rd level or lower cast from outside the barrier can't affect you, even if the power is cast using a higher level force slot. Such a power can target you, but the power has no effect on you. Similarly, the area within the barrier is excluded from the areas affected by such powers","higherlevels":"When you cast this power using a force slot of 5th level or higher, the barrier blocks powers of one level higher for each slot level above 4th.","concentration":true,"automation":[]},{"name":"Force Jump","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"Using the force to augment the strength in your legs, you leap up to 30 feet to an unoccupied space you can see.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, your jump distance increases by 5 feet for each slot level above 1st.","concentration":false,"automation":[]},{"name":"Force Lightning","level":3,"school":"V","casttime":"1 action","range":"100 feet","components":{"verbal":true,"somatic":true,"material":"Shock"},"duration":"Instantaneous","description":"A stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 8d6 lightning damage on a failed save, or half as much damage on a successful one.\nThe lightning ignites flammable objects in the area that aren't being worn or carried.","classes":"Dark Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.","concentration":false,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"dex","fail":[{"type":"damage","damage":"{damage}"}],"success":[{"type":"damage","damage":"({damage})/2"}]}],"meta":[{"type":"roll","dice":"8d6[lightning]","name":"damage","higher":{"4":"1d6[lightning]","5":"2d6[lightning]","6":"3d6[lightning]","7":"4d6[lightning]","8":"5d6[lightning]","9":"6d6[lightning]"}}]},{"type":"text","text":"Each creature in the line must make a Dexterity saving throw. A creature takes 8d6 lightning damage on a failed save, or half as much damage on a successful one."}]},{"name":"Force Lightning Cone","level":7,"school":"V","classes":"","subclasses":"","casttime":"1 action","range":"Self (60-foot cone)","components":{"verbal":false,"somatic":true,"material":"Force Chain Lightning"},"duration":"Instantaneous","ritual":false,"description":"Lightning arcs from your hands. Each creature in a 60-foot cone must make a Dexterity saving throw. A creatures takes 12d6 lightning damage on a failed save, or half as much on a successful one.","higherlevels":"When you cast this power using a force slot of 8th level or higher, the damage increases by 2d6 for each slot level above 7th.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"12d6","name":"damage","higher":{"8":"2d6","9":"4d6"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage} [lightning]"}],"success":[{"type":"damage","damage":"({damage})/2 [lightning]"}]}]}]},{"name":"Force Link","level":8,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Unlimited","components":{"verbal":true,"somatic":true,"material":""},"duration":"24 hours","ritual":false,"description":"You create a telepathic link between yourself and a willing creature with which you are familiar. Until the power ends, you and the target can instantaneously share words, images, sounds, and other sensory messages with one another through the link, and the target recognizes you as the creature it is communicating with. The power enables a creature with an Intelligence score of at least 1 to understand the meaning of your words and take in the scope of any sensory messages you send to it.","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Mend","level":7,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 minute","range":"Touch","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 hour","ritual":false,"description":"You touch a creature and stimulate its natural healing ability. The target regains 4d8+15 hit points. For the duration of the power, the target regains 1 hit point at the start of each of its turns (10 hit points each minute). \nIf the creature has a severed part you hold it to the stump, the power instantaneously causes the limb to knit to the stump. \nThis power has no effect on droids or constructs.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"damage","damage":"-(4d8+15) [healing]"}]},{"type":"text","meta":[],"text":"You touch a creature and stimulate its natural healing ability. The target regains 4d8+15 hit points. For the duration of the power, the target regains 1 hit point at the start of each of its turns (10 hit points each minute). \nIf the creature has a severed part you hold it to the stump, the power instantaneously causes the limb to knit to the stump. \nThis power has no effect on droids or constructs."}]},{"name":"Force Project","level":7,"school":"I","casttime":"1 action","range":"Self","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 day","description":"You create an illusory copy of yourself that lasts for the duration. The copy can appear at any location that you have seen before, regardless of intervening obstacles. The illusion looks and sounds like you but is intangible. If the illusion takes any damage, it disappears, and the power ends.\nYou can use your action to move this illusion up to twice your speed, and make it gesture, speak, and behave in whatever way you choose. It mimics your mannerisms perfectly.\nYou can see through its eyes and hear through its ears as if you were in its space. On your turn as a bonus action, you can switch from using its senses to using your own, or back again. While you are using its senses, you are blinded and deafened in regard to your own surroundings.\nPhysical interaction with the image reveals it to be an illusion because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your force save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and any noise it makes sounds hollow to the creature.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":null},{"name":"Force Push/Pull","level":0,"school":"T","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You gain the minor ability to move or manipulate creatures or objects with the Force. When you cast the power, and as your action each round for the duration, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below.\n**Creature**:  You use the Force to push or pull on on a target. Make a ranged force attack against the target. If the attack hits, the creature takes 1d6 force damage, and if the creature is Large or smaller, it must make a Strength saving throw. On a failed save, you push or pull the creature up to 10 feet further or closer to you. This damage increases to 2d6 at level 5, 3d6 at level 11, and 4d6 at level 17.\n**Object**: You can try to move an object that weighs up to 10 pounds. If the object isn't being worn or carried, you automatically move it up to 30 feet in any direction, but not beyond the range of this spell.\nIf the object is worn or carried, you must make an ability check with your fprcecasting ability contested by that creature's Strength check. If you succeed, you pull the object away from that creature and can move it up to 10 feet in any direction.\nYou can exert fine control on objects with your telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or retrieving an item from an open container, or pouring the contents from a vial.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"attack","meta":[],"hit":[{"type":"damage","damage":"1d6 [force]","cantripScale":true},{"type":"save","meta":[],"stat":"str","fail":[{"type":"text","meta":[],"text":"You push or pull the creature up to 10 feet further or closer to you."}],"success":[]}],"miss":[]}]}]},{"name":"Force Scream","level":3,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self (15-foot radius)","components":{"verbal":true,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You emit a scream imbued with the power of the Force. Each creature you choose within 15 feet of you must succeed on a Constitution saving throw. On a failed save, a creature take 4d6 psychic damage, 4d6 sonic damage, and is deafened until the end of its next turn. On a successful save, it takes half as much damage and isn’t deafened","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"4d6","name":"psychic"},{"type":"roll","dice":"4d6","name":"sonic"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{sonic} [sonic]"},{"type":"damage","damage":"{psychic} [psychic]"},{"type":"ieffect","meta":[],"name":"Deafened","duration":"1","effects":"","end":true}],"success":[{"type":"damage","damage":"({sonic})/2 [sonic]"},{"type":"damage","damage":"{{psychic}}/2 [psychic]"}]}]}]},{"name":"Force Sight","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":"Sense Force"},"duration":"10 minute","ritual":false,"description":"You shift your vision to see through use of the Force; colors fade and inanimate objects appear as shades of gray. You gain the following benets. \n-Living things glow with the power of the Force. Those with an affinity for the light side glow blue, those with an affinity for the dark side glow red, and those with no attunement to either side of the Force glow yellow. How bright they glow is determined by how strong their connection to the Force is. \n-You gain blindsight to 30 feet. \n-You have advantage on Wisdom (Perception) checks that rely on sight against living targets within 30 feet.","higherlevels":"","concentration":true,"automation":[]},{"name":"Force Storm","level":9,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"150 feet (60-foot cylinder)","components":{"verbal":false,"somatic":true,"material":"Force Lightning Cone"},"duration":"1 minute","ritual":false,"description":"A crackling storm of lightning appears in a location you choose within range. Whenever a creature enters the storm or starts its turn there, it must make a Dexterity saving throw. On a failed save, it takes 30d6 lightning damage or half as much as a successful one. The power damages objects in the area and ignites flammable objects that aren’t being worn or carried","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[{"type":"roll","dice":"30d6 [lightning]","name":"damage"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage}"}],"success":[{"type":"damage","damage":"({damage})/2"}]}]}]},{"name":"Force Suppression","level":3,"school":"A","casttime":"1 action","range":"120 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"Instantaneous","description":"Choose one creature, object, or force effect within range. Any force power of 3rd level or lower on the target ends. For each force power of 4th level or higher on the target, make an ability check using your forcecasting ability. The DC equals 10 + the power's level. On a successful check, the power ends.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 4th level or higher, you automatically end the effects of a force power on the target if the power's level is equal to or less than the level of the force slot you used.","concentration":false,"automation":null},{"name":"Force Technique","level":0,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"5 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 round","ritual":false,"description":"You imbue your weapon with the purifying light of the Force. As part of the action used to cast this power, you must make a melee attack with a weapon against one creature within the power's range, otherwise the power fails. On a hit, the target suffers the attack's normal effects, and it becomes wreathed in a glowing barrier of force energy until the start of your next turn. If the target willingly moves before then, it immediately takes 1d8 force damage, and the power ends. ","higherlevels":"This power's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 force damage to the target, and the damage the target takes for moving increases to 2d8. Both damage rolls increase by 1d8 at 11th level and 17th level.","concentration":false,"automation":[]},{"name":"Force Trance","level":3,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"10 minutes","ritual":false,"description":"You make a calming gesture, and up to three willing creatures of your choice that you can see within range fall unconscious for the power’s duration. The power ends on a target early if it takes damage or someone uses an action to shake or slap it awake. If a target remains unconscious for the full duration, that target gains the benet of a short rest, and it can’t be aected by this power again until it  nishes a long rest.","higherlevels":"When you cast this power using a force slot of 4th level or higher, you can target one additional willing creature for each slot level above 3rd.","concentration":false,"automation":[]},{"name":"Freedom of Movement","level":4,"school":"A","casttime":"1 action","range":"Touch","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 hour","description":"You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and powers and enhanced effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained.\nThe target can also spend 5 feet of movement to automatically escape from unenhanced restraints.  Additionally, being underwater imposes no penalties on the target's movement or attacks.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":[{"type":"target","target":"all","effects":[{"type":"ieffect","name":"Freedom of Movement","duration":-1,"effects":""}]},{"type":"text","text":"You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained.\n\nThe target can also spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature that has it grappled. Finally, being underwater imposes no penalties on the target's movement or attacks."}]},{"name":"Give Life","level":0,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"Placing your hand on another creature you can transfer your own life force to them. You spend and roll one of your hit dice and the creature regains that many hit points. This power has no effect on droids or constructs.","higherlevels":"","concentration":false,"automation":[]},{"name":"Grasping Vine","level":4,"school":"A","classes":"","subclasses":"","casttime":"1 bonus action","range":"30 feet","components":{"verbal":false,"somatic":true,"material":"Plant Surge"},"duration":"1 minute","ritual":false,"description":"You make a vine sprout from the ground in an unoccupied space you can see. When you cast this power, you can make the vine whip a creature up to 30 feet from it, if you can see the target. The creature must pass a Dexterity save or be pulled 20 feet directly toward the vine. \nUntil the power ends, you can use your bonus action to have the vine lash out again.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"text","meta":[],"text":"The creature must pass a Dexterity save or be pulled 20 feet directly toward the vine."}],"success":[]}]}]},{"name":"Greater Feedback","level":5,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":true,"material":"Improved Feedback"},"duration":"Instantaneous","ritual":false,"description":"You choose a point within range and cause psychic energy to explode there. Each creature in a 20-foot radius sphere centered on that point must make a Wisdom saving throw. A creature with an Intelligence score of 2 or lower can’t be affected by this power. A target takes 8d6 psychic damage on a failed save, or half as much damage on a successful one. \nAfter a failed save, a target has muddled thoughts for 1 minute. During that time, it rolls a d6 and subtracts the number rolled from all its attack rolls and ability checks, as well as its Constitution saving throws to maintain concentration. The target can make a Wisdom saving throw at the end of each of its turns, ending the effect on itself on a success.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"8d6","name":"damage"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage} [psychic]"},{"type":"text","meta":[],"text":"After a failed save, a target has muddled thoughts for 1 minute. During that time, it rolls a d6 and subtracts the number rolled from all its attack rolls and ability checks, as well as its Constitution saving throws to maintain concentration. The target can make a Wisdom saving throw at the end of each of its turns, ending the effect on itself on a success."}],"success":[{"type":"damage","damage":"({damage})/2 [psychic]"}]}]}]},{"name":"Guidance","level":0,"school":"D","casttime":"1 action","range":"Touch","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"You touch one willing creature. Once before the power ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The power then ends.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":null},{"name":"Heal","level":1,"school":"V","casttime":"1 action","range":"Touch","components":{"verbal":true,"somatic":false,"material":""},"duration":"Instantaneous","description":"A creature of your choice that you can see within range regains hit points equal to 1d8 + your forcecasting ability modifier. This power has no effect on droids or constructs.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.","concentration":false,"automation":[{"type":"target","target":"each","effects":[{"type":"damage","damage":"-(1d8+{spell})[heal]","higher":{"2":"-(1d8[heal])","3":"-(2d8[heal])","4":"-(3d8[heal])","5":"-(4d8[heal])","6":"-(5d8[heal])","7":"-(6d8[heal])","8":"-(7d8[heal])","9":"-(8d8[heal])"}}]},{"type":"text","text":"A creature of your choice that you can see within range regains hit points equal to 1d8 + your forcecasting ability modifier. This power has no effect on droids or constructs."}]},{"name":"Hex","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 bonus action","range":"90 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 hour","ritual":false,"description":"You curse an opponent within range. Until the power ends, you deal an extra 1d6 necrotic damage to the target whenever you hit it with an attack. Also, choose one ability when you cast the power. The target has disadvantage on ability checks made with the chosen ability. \nIf the target drops to 0 hit points before this power ends, you can use a bonus action on a subsequent turn of yours to curse a new creature.","higherlevels":"When you cast this power using a force slot of 3rd or 4th level, you can maintain your concentration on the power for up to 8 hours. When you use a force slot of 5th level or higher, you can maintain your concentration on the power for up to 24 hours.","concentration":true,"automation":[]},{"name":"Horror","level":3,"school":"I","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":true,"material":"Fear"},"duration":"1 minute","description":"You project a phantasmal image of a creature's worst fears. Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration.\nWhile frightened by this power, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn't have line of sight to you, the creature can make a Wisdom saving throw. On a successful save, the power ends for that creature.","classes":"Dark Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"wis","fail":[{"type":"ieffect","name":"Frightened (Fear)","duration":10,"effects":""}],"success":[]}]},{"type":"text","text":"Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration.\nWhile frightened by this power, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn't have line of sight to you, the creature can make a Wisdom saving throw. On a successful save, the power ends for that creature."}]},{"name":"Improved Battle Meditation","level":5,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self (5-foot radius)","components":{"verbal":true,"somatic":false,"material":"Battle Meditation"},"duration":"1 minute","ritual":false,"description":"You exude an aura out to 10 feet that boosts the morale and overall battle prowess you and your allies while simultaneously reducing the opposition's combat effectiveness by eroding their will to fight. \nWhenever you or a friendly creature within your meditation makes an attack roll or a saving throw, they can roll a d6 and add the number rolled to the attack roll or saving throw. \nWhenever a hostile creature within your meditation makes an attack roll or saving throw, it must first make a Charisma saving throw. On a failed save, it must roll a d6 and subtract the number rolled from the attack roll or saving throw. On a successful save, it is immune to this power for 1 day.","higherlevels":"","concentration":true,"automation":[]},{"name":"Improved Feedback","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":"Feedback"},"duration":"Instantaneous","ritual":false,"description":"You unleash a blast of psychic energy at a target within range. If the target can hear you (though it need not understand you), it must succeed on a Intelligence saving throw. On a failed save, it takes 3d6 psychic damage and must immediately use its reaction, if available, to move as far as its speed allows away from you. The creature doesn’t move into obviously dangerous ground, such as a fire or a pit. On a successful save, the target takes half as much damage and doesn’t have to move away. A deafened creature automatically succeeds on the save.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"3d6","name":"damage","higher":{"2":"1d6","3":"2d6","4":"3d6","5":"4d6","6":"5d6","7":"6d6","8":"7d6","9":"8d6"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"int","fail":[{"type":"damage","damage":"{damage} [psychic]"},{"type":"text","meta":[],"text":"On a failed save, it takes 3d6 psychic damage and must immediately use its reaction, if available, to move as far as its speed allows away from you. The creature doesn’t move into obviously dangerous ground, such as a fire or a pit."}],"success":[{"type":"damage","damage":"({damage})/2 [psychic]"}]}]}]},{"name":"Improved Force Camouflage","level":4,"school":"I","casttime":"1 action","range":"Touch","components":{"verbal":true,"somatic":true,"material":"Force Camouflage"},"duration":"1 minute","description":"A creature you touch becomes invisible until the power ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The power ends for a target that attacks or casts a power.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":[{"type":"target","target":"each","effects":[{"type":"ieffect","name":"Invisible","duration":10,"effects":""}]},{"type":"text","text":"You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person."}]},{"name":"Improved Force Immunity","level":6,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self (15-foot radius)","components":{"verbal":false,"somatic":true,"material":"Force Immunity"},"duration":"1 minute","ritual":false,"description":"An immobile, faintly shimmering barrier springs into existence in a 15-foot radius around you and remains for the duration. The barrier moves with you. \nAny force power of 5th level or lower cast from outside the barrier can't affect creatures or objects within it, even if the power is cast using a higher level force slot. Such a power can target creatures and objects within the barrier, but the power has no effect on them. Similarly, the area within the barrier is excluded from the areas affected by such powers.","higherlevels":"When you cast this power using a force slot of 7th level or higher, the barrier blocks powers of one level higher for each slot level above 6th.","concentration":true,"automation":[]},{"name":"Improved Force Scream","level":5,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self (30-foot radius)","components":{"verbal":true,"somatic":false,"material":"Force Scream"},"duration":"Instantaneous","ritual":false,"description":"You emit a violent scream imbued with the power of the Force. Each creature you choose within 30 feet of you must succeed on a Constitution saving throw. On a failed save, a creature take 5d6 psychic damage, 5d6 sonic damage, is deafened, and is knocked prone. On a successful save, it takes half as much damage and isn’t deafened or knocked prone.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"5d6[sonic]","name":"damage"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"damage","damage":"{damage}"},{"type":"text","meta":[],"text":" On a failed save, a creature take 5d6 psychic damage, 5d6 sonic damage, is deafened, and is knocked prone."}],"success":[{"type":"damage","damage":"({damage})/2"},{"type":"text","meta":[],"text":"On a successful save, it takes half as much damage and isn’t deafened or knocked prone."}]}]}]},{"name":"Improved Heal","level":5,"school":"V","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":"Heal"},"duration":"Instantaneous","description":"A wave of healing energy washes out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your forcecasting ability modifier. This power has no effect on droids or constructs.","classes":"Cleric","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 6th level or higher, the healing increases by 1d8 for each slot level above 5th.","concentration":false,"automation":[{"type":"target","target":"each","effects":[{"type":"damage","damage":"-(3d8+{spell})[heal]","higher":{"6":"-(1d8) [heal]","7":"-(2d8) [heal]","8":"-(3d8) [heal]","9":"-(4d8) [heal]"}}]},{"type":"text","text":"A wave of healing energy washes out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your forcecasting ability modifier. This power has no effect on droids or constructs."}]},{"name":"Improved Phasestrike","level":5,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":true,"material":"Phasestrike"},"duration":"Instantaneous","ritual":false,"description":"Choose up to five creatures you can see within range. Make a melee force attack against each one. On hit, a target takes 6d10 force damage. You can then teleport to an unoccupied space you can see within 5 feet of one of the creatures you chose.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"attack","meta":[],"hit":[{"type":"damage","damage":"6d10 [force]"},{"type":"text","meta":[],"text":"Choose up to five creatures you can see within range. Make a melee force attack against each one. On hit, a target takes 6d10 force damage. You can then teleport to an unoccupied space you can see within 5 feet of one of the creatures you chose."}],"miss":[]}]}]},{"name":"Improved Phasewalk","level":5,"school":"A","classes":"","subclasses":"","casttime":"1 bonus action","range":"Self","components":{"verbal":true,"somatic":false,"material":"Phasewalk"},"duration":"1 minute","ritual":false,"description":"You teleport up to 60 feet to an unoccupied space you can see. On each of your turns before the power ends, you can use a bonus action to teleport in this way again.","higherlevels":"","concentration":true,"automation":[]},{"name":"Improved Revitalize","level":7,"school":"N","casttime":"10 minutes","range":"Touch","components":{"verbal":true,"somatic":true,"material":"Revitalize"},"duration":"Instantaneous","description":"You return a dead creature you touch to life, provided that it has been dead no longer than 1 hour. If the creature's soul is both willing and at liberty to rejoin the body, the creature returns to life with all its hit points.\nThis power also neutralizes any poisons and cures diseases that affected the creature at the time it died. \nThis power closes all mortal wounds and restores any missing body parts.\nComing back from the dead is an ordeal. The target takes a −4 penalty to all attack rolls, saving throws, and ability checks. Every time the target finishes a long rest, the penalty is reduced by 1 until it disappears.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":null},{"name":"Insanity","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self (30-foot sphere)","components":{"verbal":true,"somatic":false,"material":"Horror"},"duration":"1 minute","ritual":false,"description":"This power assaults and twists creatures' minds, spawning delusions and provoking uncontrolled action. Each creature in a 30-foot-radius sphere centered on you must succeed on a Wisdom saving throw when you cast this power or be affected by it. \nAn affected target can’t take reactions and must roll ad8 at the start of each of its turns to determine its behavior for that turn. This power has no effect on constructs or droids.\nd8  Behavior\n1 The creature uses all its movement to move in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The creature doesn’t take an action this turn.\n2-6 The creature doesn’t move or take actions this turn.\n7-8 The creature uses its action to make a melee attack against a randomly determined creature within its reach. If there is no creature within its reach, the creature does nothing this turn.\nAt the end of each of its turns, an affected target can make a Wisdom saving throw. If it succeeds, this effect ends for that target.","higherlevels":"When you cast this power using a power slot of 6th level or higher, the radius of the sphere increases by 5 feet for each force slot level above 5th.","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[{"type":"text","meta":[],"text":"An affected target can’t take reactions and must roll ad8 at the start of each of its turns to determine its behavior for that turn."}],"success":[]}]}]},{"name":"Kill","level":9,"school":"E","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":"Ruin"},"duration":"Instantaneous","description":"You compel one creature you can see within range to die instantly. If the creature you choose has 100 hitpoints or fewer, it dies. Otherwise, the power has no effect.","classes":"Dark Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":null},{"name":"Knight Speed","level":3,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":"Burst of Speed"},"duration":"1 minute","ritual":false,"description":"Choose a willing creature that you can see within range. Until the power ends, the target’s speed is doubled, it gains a +2 bonus to AC, it has advantage onDexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.\nWhen the power ends, the target can’t move or take actions until after its next turn, as a wave of lethargy sweeps over it.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"ieffect","meta":[],"name":"Knight Speed","duration":"10","effects":"-ac +2","end":true}]},{"type":"text","meta":[],"text":"Choose a willing creature that you can see within range. Until the power ends, the target’s speed is doubled, it gains a +2 bonus to AC, it has advantage onDexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.\nWhen the power ends, the target can’t move or take actions until after its next turn, as a wave of lethargy sweeps over it."}]},{"name":"Lightning Charge","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"5 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 round","ritual":false,"description":"You imbue your weapon with debilitating force lightning. As part of the action used to cast this power, you must make a melee attack with a weapon against one creature within the power's range, otherwise the power fails. On a hit, the target suffers the attacks normal effects, and the lightning leaps from the target to a different creature of your choice that you can see within 5 feet of it. The second creature takes lightning damage equal to your forcecasting ability modifier. ","higherlevels":"This power's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 lightning damage to the target, and the lightning damage to the second creature increases to1d8 + your forcecasting ability modifier. Both damage rolls increase by 1d8 at 11th level and 17th level.","concentration":false,"automation":[]},{"name":"Locate Creature","level":4,"school":"D","casttime":"1 action","range":"Self","components":{"verbal":true,"somatic":true,"material":"Locate Object"},"duration":"1 minute","description":"Describe or name a creature familiar to you. You sense the direction to the creature's location, as long as its within 1000 feet of you. If the creature is in motion, you know the direction of its movement. The power can locate a specific creature known to you or the nearest of a specific kind, as long as you have seen it while within 30 feet of it. If the creature is in a different form, the power doesn't work. This power can't locate a creature if running water at least 10 feet wide blocks a direct path between you and the creature.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":null},{"name":"Locate Object","level":2,"school":"D","casttime":"1 action","range":"Self","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"Describe or name an object. You sense the direction to the object's location, as long as its within 1000 feet of you. If the object is in motion, you know the direction of its movement. The power can locate a specific object known to you, as long as you have seen it while within 30 feet of it. Alternatively, the power can locate the nearest object of a particular kind. This power can't locate an object if any thickness of lead blocks a direct path between you and the object","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":null},{"name":"Maddening Darkness","level":8,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"150 feet","components":{"verbal":true,"somatic":false,"material":"Shroud of Darkness"},"duration":"10 minutes","ritual":false,"description":"Terrifying darkness spreads from a point you choose within range to fill a 60-foot-radius sphere until the power ends. The darkness spreads around corners. A creature with darkvision can’t see through this darkness. Unenhanced light, as well as light created by powers of 8th level or lower, can’t illuminate the area. Shrieks, gibbering, and mad laughter can be heard within the sphere. Whenever a creature starts its turn in the sphere, it must make a Wisdom saving throw, taking 8d8 psychic damage on a failed save, or half as much damage on a successful one.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[{"type":"roll","dice":"8d8 [psychic]","name":"damage"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[{"type":"damage","damage":"{damage}"}],"success":[{"type":"damage","damage":"({damage})/2"}]}]},{"type":"text","meta":[],"text":"Terrifying darkness spreads from a point you choose within range to fill a 60-foot-radius sphere until the power ends. The darkness spreads around corners. A creature with darkvision can’t see through this darkness. Unenhanced light, as well as light created by powers of 8th level or lower, can’t illuminate the area. Shrieks, gibbering, and mad laughter can be heard within the sphere. Whenever a creature starts its turn in the sphere, it must make a Wisdom saving throw, taking 8d8 psychic damage on a failed save, or half as much damage on a successful one."}]},{"name":"Master Battle Meditation","level":9,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self (15-foot radius)","components":{"verbal":true,"somatic":false,"material":"Improved Battle Meditation"},"duration":"1 minute","ritual":false,"description":"You exude an aura out to 15 feet that boosts the morale and overall battle prowess you and your allies while simultaneously reducing the opposition's combat effectiveness by eroding their will to fight. \nWhenever you or a friendly creature within your meditation makes an attack roll or a saving throw, they can roll a d8 and add the number rolled to the attack roll or saving throw. \nWhenever a hostile creature within your meditation makes an attack roll or saving throw, it must first make a Charisma saving throw. On a failed save, it must roll a d8 and subtract the number rolled from the attack roll or saving throw. On a successful save, it is immune to this power for 1 day.","higherlevels":"","concentration":true,"automation":[]},{"name":"Master Feedback","level":9,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"90 feet","components":{"verbal":false,"somatic":true,"material":"Greater Feedback"},"duration":"Instantaneous","ritual":false,"description":"You unleash the power of your mind to blast the intellect of up to ten creatures of your choice that you can see within range. Creatures that have an Intelligence score of 2 or lower are unaffected. \nEach target must make a Intelligence saving throw. On a failed save, a target takes 14d6 psychic damage and is stunned. On a successful save, a target takes half as much damage and isn’t stunned. \nA stunned target can make a Intelligence saving throw at the end of each of its turns. On a successful save, the stunning effect ends..","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"14d6","name":"damage"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"int","fail":[{"type":"damage","damage":"{damage} [psychic]"},{"type":"text","meta":[],"text":" On a failed save, a target takes 14d6 psychic damage and is stunned."}],"success":[{"type":"damage","damage":"({damage})/2 [psychic]"}]}]}]},{"name":"Master Force Immunity","level":8,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self (10-foot radius)","components":{"verbal":true,"somatic":false,"material":"Improved Force Immunity"},"duration":"1 hour","ritual":false,"description":"A 10-foot-radius faintly shimmering barrier surrounds you. Within the sphere, powers can’t be cast and enhanced items become mundane. Until the power ends, the sphere moves with you, centered on you. \nPowers and other enhanced effects are suppressed in the sphere and can’t protrude into it. A slot expended to cast a suppressed power is consumed. While an effect is suppressed, it doesn’t function, but the time it spends suppressed counts against its duration. \n**Targeted  Effects.** Powers and other enhanced effects that target a creature or an object in the sphere have no effect on that target. \n**Enhanced  Areas.**  The area of another power or enhanced effect, such as *force storm*, can’t extend into the sphere. If the sphere overlaps an enhanced area, the part of the area that is covered by the sphere is suppressed. \n**Powers.**  Any active power or other enhanced effect on a creature or an object in the sphere is suppressed while the creature or object is in it. \n**Enhanced  Items.**  The properties and powers of enhanced items are suppressed in the sphere. For example, a +1 vibrosword in the sphere functions as an unenhanced vibrosword. \nAn enhanced weapon’s properties and powers are suppressed if it is used against a target in the sphere or wielded by an attacker in the sphere. If an enhanced weapon or a piece of enhanced ammunition fully leaves the sphere (for example, if you fire an enhanced shot or throw an enhanced saberspear at a target outside the sphere), the enhancement of the item ceases to be suppressed as soon as it exits. \n**Enhanced  Travel.**  Teleportation fails to work in the sphere, whether the sphere is the destination or the departure point for such enhanced travel. A portal to another location temporarily closes while in the sphere. \n**Creatures and Objects.**  A creature or object summoned or created by powers temporarily winks out of existence in the sphere. Such a creature instantly reappears once the space the creature occupied is no longer within the sphere. \n**Tech  Override/Sever Force.**  Powers and enhanced effects such as *sever force* have no effect on the sphere. Likewise, the spheres created by different scrambling field powers don’t nullify each other.","higherlevels":"","concentration":true,"automation":[]},{"name":"Master Force Scream","level":8,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self (60-foot radius)","components":{"verbal":true,"somatic":false,"material":"Improved Force Scream"},"duration":"Instantaneous","ritual":false,"description":"You emit a cacophonous scream imbued with the power of the Force. Each creature you choose within 60 feet of you must succeed on a Constitution saving throw. On a failed save, a creature takes 6d6 psychic damage, 6d6 sonic damage, is deafened, knocked prone, and blinded for 1 minute. On a successful save, it takes half as much damage and isn’t deafened, knocked prone, or blinded by this power. \nA creature blinded by this power makes another Constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"6d6[sonic]","name":"sonic"},{"type":"roll","dice":"6d6[psychic]","name":"psychic"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"damage","damage":"{sonic}"},{"type":"damage","damage":"{psychic}"},{"type":"text","meta":[],"text":" On a failed save, a creature take 6d6 psychic damage, 6d6 sonic damage, is deafened, knocked prone, and blinded for one minute."}],"success":[{"type":"damage","damage":"({sonic})/2"},{"type":"damage","damage":"{{psychic}}/2"},{"type":"text","meta":[],"text":"On a successful save, it takes half as much damage and isn’t deafened or knocked prone."}]}]}]},{"name":"Master Heal","level":9,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":"Improved Heal"},"duration":"Instantaneous","ritual":false,"description":"A wave of healing energy washes over the creature you touch. The target regains all its hit points. If the creature is charmed, frightened, paralyzed, or stunned, the condition ends. If the creature is prone, it can use its reaction to stand up. This power has no effect on droids or constructs.","higherlevels":"","concentration":false,"automation":[]},{"name":"Master Revitalize","level":9,"school":"A","classes":"","subclasses":"","casttime":"1 hour","range":"Touch","components":{"verbal":false,"somatic":true,"material":"Improved Revitalize"},"duration":"Instantaneous","ritual":false,"description":"You return a dead creature you touch to life, provided that it has been dead no longer than 1 day. If the creature’s soul is both willing and at liberty to rejoin the body, the creature returns to life with all its hit points. \nThis power closes all wounds, neutralizes any poison, cures all diseases, and lifts any curses affecting the creature when it died. The power replaces damaged or missing organs and limbs","higherlevels":"","concentration":false,"automation":[]},{"name":"Master Speed","level":7,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":"Knight Speed"},"duration":"1 minute","ritual":false,"description":"Choose up to two willing creatures that you can see within range. Until the power ends, each target’s speed is doubled, they gains a +2 bonus to AC, they have advantage on Dexterity saving throws, and they gain an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.\nWhen the power ends, each target can’t move or take actions until after its next turn, as a wave of lethargy sweeps over it.","higherlevels":"When you cast this power using a force slot of 8th-level or higher, you can target one additional creature for each slot level above 7th.","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"ieffect","meta":[],"name":"Knight Speed","duration":"10","effects":"-ac +2","end":true}]},{"type":"text","meta":[],"text":"Choose a willing creature that you can see within range. Until the power ends, the target’s speed is doubled, it gains a +2 bonus to AC, it has advantage onDexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.\nWhen the power ends, the target can’t move or take actions until after its next turn, as a wave of lethargy sweeps over it."}]},{"name":"Mind Blank","level":8,"school":"A","casttime":"1 action","range":"Touch","components":{"verbal":true,"somatic":true,"material":"Prerequisite: *Mind Trap*"},"duration":"24 hours","description":"Until the power ends, one willing creature you touch is immune to psychic and sonic damage, any effect that would sense its emotions or read its thoughts, and the charmed condition. The power foils powers or effects of similar power used to affect the target’s mind or to gain information about the target.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":[{"type":"target","target":"each","effects":[{"type":"ieffect","name":"Mind Blank","duration":-1,"effects":"-immune psychic -immune sonic"}]},{"type":"text","text":"Until the power ends, one willing creature you touch is immune to psychic and sonic damage, any effect that would sense its emotions or read its thoughts, and the charmed condition. The power foils powers or effects of similar power used to affect the target’s mind or to gain information about the target."}]},{"name":"Mind Spike","level":2,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 hour","ritual":false,"description":"Choose one creature you can see. The target must make a Wisdom saving throw. A creature takes 3d8 psychic damage on a failed save, or half as much damage on a successful one. Additionally, on a failed save, you also always know the target's location, but only while the two of you are on the same planet. The target can't become hidden from you, and if it's invisible, it gains no benefits from this condition against you. This power has no effect on droids or constructs.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[{"type":"roll","dice":"3d8","name":"psychic"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[{"type":"damage","damage":"{psychic} [psychic]"},{"type":"text","meta":[],"text":"A creature takes 3d8 psychic damage on a failed save, or half as much damage on a successful one. Additionally, on a failed save, you also always know the target's location, but only while the two of you are on the same planet. The target can't become hidden from you, and if it's invisible, it gains no benefits from this condition against you. This power has no effect on droids or constructs."}],"success":[{"type":"damage","damage":"{psychic}/2 [psychic]"}]}]}]},{"name":"Mind Trick","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","ritual":false,"description":"Choose a target within range that isn’t hostile toward you. The target must make a Wisdom saving throw. On a failed save, the target has disadvantage on Wisdom (Perception) and Intelligence (Investigation) checks. \nOn a successful save, the creature realizes that you tried to use the Force to influence its awareness and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM’s discretion), depending on the nature of your interaction with it. This power has no effect on droids or constructs.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[{"type":"text","meta":[],"text":"On a failed save, the target has disadvantage on Wisdom (Perception) and Intelligence (Investigation) checks."}],"success":[{"type":"text","meta":[],"text":"On a successful save, the creature realizes that you tried to use the Force to influence its awareness and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM’s discretion), depending on the nature of your interaction with it"}]}]}]},{"name":"Phasestrike","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 bonus action","range":"Self","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"Until the power ends, your movement doesn’t provoke opportunity attacks. \nOnce before the power ends, you can give yourself advantage on one weapon attack roll on your turn. That attack deals an extra 1d8 force damage on a hit. Whether you hit or miss, your walking speed increases by 30 feet until the end of that turn.","higherlevels":"","concentration":true,"automation":[]},{"name":"Phasewalk","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 bonus action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneos","ritual":false,"description":"You teleport up to 30 feet to an unoccupied space that you can see.","higherlevels":"","concentration":false,"automation":[]},{"name":"Plague","level":3,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":"Affliction"},"duration":"1 minute","ritual":false,"description":"Choose up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a Constitution saving throw or be affected by this power for the duration. \nAn affected target’s speed is halved, it takes a -2 penalty to AC and Dexterity saving throws, and it can’t use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature’s abilities or items, it can’t make more than one melee or ranged attack during its turn. \nIf the creature attempts to cast a power with a casting time of 1 action, roll a d20. On an 11 or higher, the power doesn’t take effect until the creature’s next turn, and the creature must use its action on that turn to complete the power. If it can’t, the power is wasted. \nA creature affected by this power makes another Wisdom saving throw at the end of its turn. On a successful save, the effect ends for it.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"ieffect","meta":[],"name":"Plague","duration":"10","effects":"-ac -2","end":true},{"type":"text","meta":[],"text":"An affected target’s speed is halved, it takes a -2 penalty to AC and Dexterity saving throws, and it can’t use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature’s abilities or items, it can’t make more than one melee or ranged attack during its turn. \nIf the creature attempts to cast a power with a casting time of 1 action, roll a d20. On an 11 or higher, the power doesn’t take effect until the creature’s next turn, and the creature must use its action on that turn to complete the power. If it can’t, the power is wasted. \nA creature affected by this power makes another Wisdom saving throw at the end of its turn. On a successful save, the effect ends for it."}],"success":[]}]}]},{"name":"Plant Surge","level":3,"school":"T","casttime":"1 action or 8 hours","range":"150 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"Instantaneous","description":"If you cast this spell using 1 action, all normal plants in a 100-foot radius centered on that point become thick and overgrown. Moving through the area spends 4 feet of movement for every 1 foot moved.\nYou can exclude one or more areas of any size within the spell's area from being affected.\nIf you cast this spell over 8 hours, all plants in a half-mile radius centered on a point within range yield twice the normal amount of food when harvested for 1 year.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":null},{"name":"Precognition","level":9,"school":"D","casttime":"1 minute","range":"Self","components":{"verbal":true,"somatic":true,"material":"Prerequisite: *Danger Sense*"},"duration":"8 hours","description":"Your mastery of the force gives you a limited ability to see into the immediate future. For the duration, you can’t be surprised and you have advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have disadvantage on attack rolls against you for the duration.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":null},{"name":"Project","level":1,"school":"V","casttime":"1 action","range":"120 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"Instantaneous","description":"You lift three piles of debris from the ground and throw them. Each pile hits a creature of your choice that you can see within range. A pile deals 1d4 + 1 force damage to its target. The piles all strike simultaneously, and you can direct them to hit one creature or several.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 2nd level or higher, you lift and throw an additional pile of debris for each slot level above 1st.","concentration":false,"automation":[{"type":"target","target":"all","effects":[{"type":"damage","damage":"{damage}"}],"meta":[{"type":"roll","dice":"1d4+1[force]","name":"damage"}]},{"type":"text","text":"Each dart hits a creature of your choice that you can see within range. A dart deals 1d4+1 force damage to its target. The darts all strike simultaneously and you can direct them to hit one creature or several."}]},{"name":"Rage","level":6,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"10 minutes","ritual":false,"description":"You endow yourself with endurance and martial prowess fueled by the Force. Until the power ends, you can’t cast powers, and you gain the following benefits:\n-You gain 50 temporary hit points. If any of these remain when the power ends, they are lost.\n-You have advantage on attack rolls that you make with lightweapons and vibroweapons.\n-When you hit a target with a weapon attack, that target takes an extra 2d12 force damage.\n-You have proficiency with all armor, lightweapons, and vibroweapons.\n-You have proficiency in Strength and Constitution saving throws.\n-You can attack twice, instead of once, when you take the Attack action on your turn. You ignore this benefit if you already have a feature, like Extra Attack, that gives you extra attacks.\nImmediately after the power ends, you must succeed on a DC 15 Constitution saving throw or suer one level of exhaustion.","higherlevels":"","concentration":true,"automation":[]},{"name":"Rescue","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 bonus action","range":"30 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You pull one willing ally you can see within 30 feet of you to an unoccupied space within 5 feet of you. The target must use their reaction to accept the pull.","higherlevels":"","concentration":false,"automation":[]},{"name":"Resistance","level":0,"school":"A","casttime":"1 action","range":"Touch","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"You touch one willing creature. Once before the power ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The power then ends.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":[{"type":"target","target":"each","effects":[{"type":"ieffect","name":"Resistant","duration":10,"effects":""}]},{"type":"text","text":"You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The spell then ends."}]},{"name":"Revitalize","level":5,"school":"N","classes":"Light Side Power","subclasses":"","casttime":"1 minute","range":"Touch","components":{"verbal":false,"somatic":true,"material":"Spare the Dying"},"duration":"Instantaneous","ritual":false,"description":"You return a dead creature you touch to life, provided that it has been dead no longer than 10 minutes. If the creature’s soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point. \nThis power also neutralizes any poisons and cures diseases that aected the creature at the time it died. \nThis power closes all mortal wounds, but it doesn’t restore missing body parts. If the creature is lacking body parts or organs integral for its survival—its head, for instance—the power automatically fails. \nComing back from the dead is an ordeal. The target takes a - 4 penalty to all attack rolls, saving throws, and ability checks. Every time the target  nishes a long rest, the penalty is reduced by 1 until it disappears","higherlevels":"","concentration":false,"automation":[]},{"name":"Ruin","level":7,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":"Wound"},"duration":"Instantaneous","ritual":false,"description":"You channel the dark side of the Force to desecrate a creature you can see within range, causing waves of intense pain to assail it. If the target has 100 hit points or fewer, it is subject to crippling pain. Otherwise, the power has no effect on it. \nWhile the target is affected by crippling pain, any speed it has can be no higher than 10 feet. The target also has disadvantage on attack rolls, ability checks, and saving throws, other than Constitution saving throws. Finally, if the target tries to cast a power, it must first succeed on a Constitution saving throw, or the casting fails and the power is wasted.\nA target suffering this pain can make a Constitution saving throw at the end of each of its turns. On a successful save, the pain ends.","higherlevels":"","concentration":false,"automation":[]},{"name":"Saber Reflect","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 reaction, which you take in response to being hit by a ranged attack","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"In response to being attacked, you raise your weapon to attempt to deflect. When you you use this power, the damage you take from the attack is reduced by 1d6. If you reduce the damage to 0, you're wielding a lightweapon or vibroweapon, and the damage is energy or ion, you can reflect the attack at a target within range as part of the same reaction. Make a ranged force attack at a target you can see. The attack has a normal range of 20 feet and a long range of 60 feet. On a hit, the target takes the triggering attack's normal damage. \nThe power's damage reduction increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).","higherlevels":"","concentration":false,"automation":[]},{"name":"Saber Throw","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"As a part of the action used to cast this power, you must make a ranged force attack with a lightweapon or vibroweapon against one target within the power's range, otherwise the power fails. On a hit, the target takes 1d8 energy damage. The weapon then immediately returns to your hand. \nThis power can hit multiple targets when you reach higher levels: two targets at 5th level, three targets at 11th level, and four targets at 17th level. Each target must be within 30 feet of the previous target, you must make a separate attack roll for each target, and the last target must be no further than 30 feet away from you. You can not hit the same target twice in succession.","higherlevels":"","concentration":false,"automation":[]},{"name":"Saber Ward","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You take a defensive stance. Until the end of your next turn, you have resistance against kinetic and energy damage dealt by weapons.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[],"target":"self","effects":[{"type":"ieffect","meta":[],"name":"Saber Ward","duration":"1","effects":"-resist kinetic -resist energy","end":true}]},{"type":"text","meta":[],"text":"You take a defensive stance. Until the end of your next turn, you have resistance against kinetic and energy damage dealt by weapons."}]},{"name":"Sanctuary","level":1,"school":"A","casttime":"1 bonus action","range":"30 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack, a harmful power, or a hostile action must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or power. This power doesn't protect the warded creature from area effects.\nIf the warded creature makes an attack, casts a power that affects an enemy, or takes a hostile action this power ends.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":[{"type":"target","target":"all","effects":[{"type":"ieffect","name":"Sanctuary","duration":10,"effects":""}]},{"type":"text","text":"Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball.\n\nIf the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends."}]},{"name":"Sap Vitality","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"Make a melee force attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st.","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"attack","meta":[],"hit":[{"type":"damage","damage":"3d10 [necrotic]","higher":{"2":"1d10 [necrotic]","3":"2d10 [necrotic]","4":"3d10 [necrotic]","5":"4d10 [necrotic]","6":"5d10 [necrotic]","7":"6d10 [necrotic]","8":"7d10 [necrotic]","9":"8d10 [necrotic]"}}],"miss":[]}]}]},{"name":"Scourge","level":6,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":"Plague"},"duration":"1 minute","ritual":false,"description":"For the power’s duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a Wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the power ends, you can use your action to target another creature but can’t target a creature again if it has succeeded on a saving throw against this casting of *scourge*. \n**Asleep.**  The target falls unconscious. It wakes up if it takes any damage or if another creature uses its action to shake the sleeper awake. \n**Panicked.**  The target is frightened of you. On each of its turns, the frightened creature must take the Dash action and move away from you by the safest and shortest available route, unless there is nowhere to move. If the target moves to a place at least 60 feet away from you where it can no longer see you, this effect ends. \n**Sickened.**  The target has disadvantage on attack rolls and ability checks. At the end of each of its turns, it can make another Wisdom saving throw. If it succeeds, the effect ends.","higherlevels":"","concentration":true,"automation":[]},{"name":"Sense Emotion","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"10 minutes","ritual":false,"description":"You attune your senses to pick up the emotions of others for the duration. When you cast the power, and as your action on each turn until the power ends, you can focus your senses on one humanoid you can see within 30 feet of you. You instantly learn the target’s prevailing emotion, whether it’s love, anger, pain, fear, calm, or something else. If the target isn’t actually humanoid or it is immune to being charmed, you sense that it is calm.","higherlevels":"","concentration":true,"automation":[]},{"name":"Sense Force","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"10 minutes","ritual":false,"description":"For the duration, you sense the use of the Force, or its presence in an inanimate object within 30 feet of you. If you sense the Force in this way, you can use your action to determine the direction from which it originates and, if it's in line of sight, you see a faint aura around the person or object from which the Force emanates.","higherlevels":"When you cast this power using a 3rd-level force slot, the range increases to 60 feet. When you use a 5th-level force slot, the range increases to 500 feet. When you use a 7th-level force slot, the range increases to 1 mile. When you use a 9th-level force slot, the range increases to 10 miles.","concentration":true,"automation":[]},{"name":"Sever Force","level":3,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 reaction","range":"60 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You attempt to interrupt a creature in the process of casting a force power. If the creature is casting a power of 3rd level or lower, its power fails and has no effect. If it is casting a power of 4th level or higher, make an ability check using your forcecasting ability. The DC equals 10 + the power’s level. On a success, the creature’s power fails and has no effect.","higherlevels":"When you cast this power using a force slot of 4th level or higher, the interrupted power has no effect if its level is less than or equal to the level of the force slot you used.","concentration":false,"automation":[]},{"name":"Share Life","level":3,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":true,"material":"Give Life"},"duration":"Instantaneous","ritual":false,"description":"You sacrifice some of your health to mend another creature’s injuries. You take 4d8 necrotic damage, and one creature of your choice that you can see within range regains a number of hit points equal to twice the necrotic damage you take. This power has no effect on droids or constructs.","higherlevels":"When you cast this power using a force slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"4d8","name":"damage","higher":{"4":"1d8","5":"2d8","6":"3d8","7":"4d8","8":"5d8","9":"6d8"}}],"target":"self","effects":[{"type":"damage","damage":"{damage} [necrotic]"}]},{"type":"target","meta":[],"target":"each","effects":[{"type":"damage","damage":"(-{{damage}}*2) [heal]"}]},{"type":"text","meta":[],"text":"You sacrifice some of your health to mend another creature’s injuries. You take 4d8 necrotic damage, and one creature of your choice that you can see within range regains a number of hit points equal to twice the necrotic damage you take. This power has no effect on droids or constructs."}]},{"name":"Shock","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You hurl a bolt of lightning at a target within range, making a ranged power attack. On a hit, the target takes 1d10 lightning damage. The lightning ignites flammable objects in the area that aren’t being worn or carried.","higherlevels":"This power's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"attack","meta":[],"hit":[{"type":"damage","damage":"1d10[lightning]","cantripScale":true}],"miss":[]}]}]},{"name":"Shocking Shield","level":4,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Shock*"},"duration":"10 minutes","ritual":false,"description":"Lightning courses in a sphere surrounding your body, shedding bright light in a 10-foot radius and dim light for an additional 10 feet. You can use your action to end the power early.\nWhenever a creature within 5 feet of you hits you with a melee attack, it takes 2d8 lightning damage.","higherlevels":"","concentration":false,"automation":[]},{"name":"Shroud of Darkness","level":4,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":"Darkness"},"duration":"1 minute","ritual":false,"description":"You become heavily obscured to others. Dim light within 10 feet of you becomes darkness, and bright light becomes dim light. Until the power ends, you have resistance to force damage. In addition, whenever a creature within 10 feet of you hits you with an attack, it takes 2d8 necrotic damage.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"self","effects":[{"type":"ieffect","meta":[],"name":"Shroud of Darkness","duration":"10","effects":"-resist force","end":true}]},{"type":"text","meta":[],"text":"You become heavily obscured to others. Dim light within 10 feet of you becomes darkness, and bright light becomes dim light. \nUntil the power ends, you have resistance to force damage. In addition, whenever a creature within 10 feet of you hits you with an attack, it takes 2d8 necrotic damage."}]},{"name":"Siphon Life","level":5,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 minute","ritual":false,"description":"A tendril of inky darkness reaches out from you, touching a creature you can see within range to drain life from it. The target must make a Dexterity saving throw. On a successful save, the target takes 2d8 necrotic damage, and the power ends. On a failed save, the target takes 4d8 necrotic damage, and until the power ends, you can use your action on each of your turns to automatically deal 4d8 necrotic damage to the target. The power ends if you use your action to do anything else, if the target is ever outside the power’s range, or if the target has total cover from you. \nWhenever the power deals damage to a target, you regain hit points equal to half the amount of necrotic damage the target takes.","higherlevels":"When you cast this power using a force slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"4d8 [necrotic]","higher":{"6":"1d8 [necrotic]","7":"2d8 [necrotic]","8":"3d8 [necrotic]","9":"4d8 [necrotic]"}},{"type":"text","meta":[],"text":"Whenever the power deals damage to a target, you regain hit points equal to half the amount of necrotic damage the target takes."}],"success":[{"type":"damage","damage":"2d8 [necrotic]","higher":{"6":"1d8 [necrotic]","7":"2d8 [necrotic]","8":"3d8 [necrotic]","9":"4d8 [necrotic]"}},{"type":"text","meta":[],"text":"Whenever the power deals damage to a target, you regain hit points equal to half the amount of necrotic damage the target takes."}]}]},{"type":"target","meta":[],"target":"self","effects":[{"type":"damage","damage":"(-{{damage}}/2) [heal]"}]}]},{"name":"Skill Empowerment","level":5,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 hour","ritual":false,"description":"Your power with the Force deepens a creature’s understanding of its own talent. You touch one willing creature and give it expertise in one skill of your choice; until the power ends, the creature doubles its proficiency bonus for ability checks it makes that use the chosen skill. \nYou must choose a skill in which the target is proficient and that isn’t already benefiting from an effect, such as Expertise, that doubles its proficiency bonus.","higherlevels":"","concentration":true,"automation":[]},{"name":"Slow","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"15 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 hour","ritual":false,"description":"A hostile creature of your choice must make a Dexterity saving throw. On a failed save, the target’s speed decreases by 10 feet until the power ends.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.","concentration":false,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"text","meta":[],"text":"On a failed save, the target’s speed decreases by 10 feet until the power ends."}],"success":[]}]}]},{"name":"Slow Descent","level":1,"school":"T","casttime":"1 reaction, which you take when you or a creature within 60 feet of you falls","range":"60 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 minute","description":"Choose up to five falling creatures within range. A falling creature's rate of descent slows to 60 feet per round until the power ends. If the creature lands before the power ends, it takes no falling damage and can land on its feet, and the power ends for that creature.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":false,"automation":null},{"name":"Spare the Dying","level":0,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You touch a living creature that has 0 hit points. The creature becomes stable. This power has no effect on droids or constructs.","higherlevels":"","concentration":false,"automation":[]},{"name":"Stasis","level":5,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"90 feet","components":{"verbal":true,"somatic":false,"material":"Stun"},"duration":"1 minute","ritual":false,"description":"Choose up to 3 creatures that you can see within range. Each target must succeed on a Wisdom saving throw or be paralyzed for the duration. This power has no effect on droids or constructs. At the end of each of its turns, a target can make another Wisdom saving throw. On a success, the power ends on the target.","higherlevels":"When you cast this power using a force slot of 6th level or higher, you can target an additional creature for each slot level above 5th.","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[{"type":"text","meta":[],"text":"Each target must succeed on a Wisdom saving throw or be paralyzed for the duration."}],"success":[]}]}]},{"name":"Stasis Field","level":8,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"120 feet (30-foot cube)","components":{"verbal":true,"somatic":false,"material":"Stasis"},"duration":"1 minute","ritual":false,"description":"Choose a point that you can see within range. Each target must succeed on a Wisdom saving throw or be paralyzed for the duration. This power has no effect on droids or constructs. At the end of each of its turns, a target can make another Wisdom saving throw. On a success, the power ends on the target.","higherlevels":"When you cast this power using a force slot of 9th level, the size of the cube increases to 40 feet.","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[{"type":"text","meta":[],"text":"Each target must succeed on a Wisdom saving throw or be paralyzed for the duration."}],"success":[]}]}]},{"name":"Stun","level":2,"school":"E","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"1 minute","description":"Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the power ends on the target.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":"","concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"save","stat":"wis","fail":[{"type":"ieffect","name":"Paralyzed (Hold Person)","duration":10,"effects":""}],"success":[]}]},{"type":"text","text":"The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."}]},{"name":"Stun Droid","level":2,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"Choose a droid that you can see within range. The target must succeed on a Constitution saving throw or be paralyzed for the duration. At the beginning of each of its turns, the droid takes energy damage equal to your forcecasting ability modifier. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the power ends on the target.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"con","fail":[{"type":"damage","damage":"[spell] [energy]"},{"type":"text","meta":[],"text":"The target must succeed on a Constitution saving throw or be paralyzed for the duration. At the beginning of each of its turns, the droid takes energy damage equal to your forcecasting ability modifier. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the power ends on the target."}],"success":[]}]}]},{"name":"Telekinesis","level":5,"school":"T","casttime":"1 action","range":"60 feet","components":{"verbal":true,"somatic":true,"material":"Prerequisite: *Force Throw*"},"duration":"10 minutes","description":"You gain the ability to move or manipulate creatures or objects by thought. When you cast the spell, and as your action each round for the duration, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below. You can affect the same target round after round, or choose a new one at any time. If you switch targets, the prior target is no longer affected by the spell.\n**Creature**: You can try to move a Huge or smaller creature. Make an ability check with your spellcasting ability contested by the creature's Strength check. If you win the contest, you move the creature up to 30 feet in any direction, including upward but not beyond the range of this spell. Until the end of your next turn, the creature is restrained in your telekinetic grip. A creature lifted upward is suspended in mid-air.\nOn subsequent rounds, you can use your action to attempt to maintain your telekinetic grip on the creature by repeating the contest.\n**Object**: You can try to move an object that weighs up to 1,000 pounds. If the object isn't being worn or carried, you automatically move it up to 30 feet in any direction, but not beyond the range of this spell.\nIf the object is worn or carried by a creature, you must make an ability check with your spellcasting ability contested by that creature's Strength check. If you succeed, you pull the object away from that creature and can move it up to 30 feet in any direction but not beyond the range of this spell.\nYou can exert fine control on objects with your telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or retrieving an item from an open container, or pouring the contents from a vial.","classes":"Universal Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":null},{"name":"Telekinetic Burst","level":6,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Self (60-foot line)","components":{"verbal":false,"somatic":true,"material":"Telekinetic Gust"},"duration":"1 minute","ritual":false,"description":"A beam of Force energy flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a Constitution saving throw. On a failed save, a creature takes 8d6 force damage and is blinded until your next turn. On a successful save, it takes half as much damage and isn't blinded by this power. You can create a new line of radiance as your action on any turn until the power ends.","higherlevels":"When you cast this power using a force slot of 7th level or higher, the damage increases by 2d6 for each slot level above 6th.","concentration":true,"automation":[{"type":"target","meta":[{"type":"roll","dice":"8d6 [force]","name":"damage","higher":{"7":"2d6 [force]","8":"4d6 [force]","9":"6d6 [force]"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage}"},{"type":"text","meta":[],"text":"On a failed save, a creature takes 8d6 force damage and is blinded until your next turn"}],"success":[{"type":"damage","damage":"({damage})/2"}]}]}]},{"name":"Telekinetic Wave","level":8,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"150 feet","components":{"verbal":false,"somatic":false,"material":"Telekinetic Burst"},"duration":"Instantaneous","ritual":false,"description":"You manipulate the Force in a 60-foot radius centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. On a failed save, a creature takes 12d6 force damage and is blinded for 1 minute. On a successful save, it takes half as much damage and isn’t blinded by this power. \nA creature blinded by this power makes another Constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded.","higherlevels":"When you cast this power using a force slot of 9th level, the damage increases by 2d6.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"12d6 [force]","name":"damage","higher":{"9":"2d6 [force]"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage}"},{"type":"text","meta":[],"text":"On a failed save, a creature takes 12d6 force damage and is blinded for 1 minute."}],"success":[{"type":"damage","damage":"({damage})/2"}]}]}]},{"name":"Tremor","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"10 feet","components":{"verbal":true,"somatic":false,"material":"Burst"},"duration":"Instantaneous","ritual":false,"description":"You cause a tremor in the ground within range. Each creature other than you in a 5-foot-radius sphere centered on that point must make a Dexterity saving throw. On a failed save, a creature takes 1d6 kinetic damage and is knocked prone. If the ground in that area is loose earth or stone, it becomes difficult terrain until cleared, with each 5-foot-diameter portion requiring at least 1 minute to clear by hand.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"1d6 [kinetic]","name":"damage","higher":{"2":"1d6 [kinetic]","3":"2d6 [kinetic]","4":"3d6 [kinetic]","5":"4d6 [kinetic]","6":"5d6 [kinetic]","7":"6d6 [kinetic]","8":"7d6 [kinetic]","9":"8d6 [kinetic]"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage}"},{"type":"text","meta":[],"text":"On a failed save, a creature takes 1d6 kinetic damage and is knocked prone."}],"success":[{"type":"damage","damage":"({damage})/2"}]}]}]},{"name":"Turbulence","level":0,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"Choose one creature, or choose two creatures that are within 5 feet of each other, within range. A target must succeed on a Dexterity saving throw or take 1d6 force damage.","higherlevels":"This power's damage increases by 1d6 when you reach 5th, 11th, and 17th level.","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"1d6 [force]","cantripScale":true}],"success":[]}]}]},{"name":"Valor","level":1,"school":"E","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":true,"material":"Guidance"},"duration":"1 minute","description":"You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the power ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":"When you cast this power using a force slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.","concentration":true,"automation":[{"type":"target","target":"all","effects":[{"type":"ieffect","name":"Blessed","duration":10,"effects":"-b 1d4[Bless] -sb 1d4[Bless]"}]},{"type":"text","text":"Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw."}]},{"name":"Wall of Light","level":6,"school":"V","casttime":"1 action","range":"120 feet","components":{"verbal":true,"somatic":true,"material":""},"duration":"10 minutes","description":"You conjure an immense manifestation of destructive light side Force energy. The wall appears within range and lasts for the duration. You can make a straight wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides three-quarters cover and its space is difficult terrain. \nWhen a creature enters the wall's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw. On a failed save, the creature takes 6d10 force damage, or half as much on a success.","classes":"Light Side Power","subclasses":"","ritual":false,"higherlevels":null,"concentration":true,"automation":null},{"name":"Whirlwind","level":7,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"300 feet","components":{"verbal":true,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"A whirlwind howls down to a point that you can see on the ground within range. The whirlwind is a 10-foot radius, 30-foot-high cylinder centered on that point. Until the power ends, you can use your action to move the whirlwind up to 30 feet in any direction along the ground. The whirlwind sucks up any Medium or smaller objects that aren’t secured to anything and that aren’t worn or carried by anyone.\nA creature must make a Dexterity saving throw the first time on a turn that it enters the whirlwind or that the whirlwind enters its space, including when the whirlwind first appears. A creature takes 10d6 kinetic damage on a failed save, or half as much damage on a successful one. In addition, a Large or smaller creature that fails the save must succeed on a Strength saving throw or become restrained in the whirlwind until the power ends. When a creature starts its turn restrained by the whirlwind, the creature is pulled 5 feet higher inside it, unless the creature is at the top. A restrained creature moves with the whirlwind and falls when the power ends, unless the creature has some means to stay aloft. \nA restrained creature can use an action to make a Strength or Dexterity check against your force save DC. If successful, the creature is no longer restrained by the whirlwind and is hurled 3d6x10 feet away from it in a random direction.","higherlevels":"","concentration":true,"automation":[{"type":"target","meta":[{"type":"roll","dice":"10d6 [kinetic]","name":"damage"}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage}"},{"type":"save","meta":[],"stat":"str","fail":[{"type":"text","meta":[],"text":"A creature takes 10d6 kinetic damage on a failed save, or half as much damage on a successful one. In addition, a Large or smaller creature that fails the save must succeed on a Strength saving throw or become restrained in the whirlwind until the power ends."}],"success":[{"type":"text","meta":[],"text":"A creature takes 10d6 kinetic damage on a failed save, or half as much damage on a successful one. In addition, a Large or smaller creature that fails the save must succeed on a Strength saving throw or become restrained in the whirlwind until the power ends."}]}],"success":[{"type":"damage","damage":"({damage})/2"}]}]}]},{"name":"Wound","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You make a piercing gesture at a creature within range. Make a ranged force attack against the target. On a hit, the target takes 2d8 necrotic damage and must make a Constitution saving throw. On a failed save, it is also poisoned until the end of your next turn.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"attack","meta":[],"hit":[{"type":"damage","damage":"2d8 [necrotic]","higher":{"2":"1d8 [necrotic]","3":"2d8 [necrotic]","4":"3d8 [necrotic]","5":"4d8 [necrotic]","6":"5d8 [necrotic]","7":"6d8 [necrotic]","8":"7d8 [necrotic]","9":"8d8 [necrotic]"}},{"type":"save","meta":[],"stat":"con","fail":[{"type":"text","meta":[],"text":"On a hit, the target takes 2d8 necrotic damage and must make a Constitution saving throw. On a failed save, it is also poisoned until the end of your next turn."}],"success":[{"type":"text","meta":[],"text":"On a hit, the target takes 2d8 necrotic damage and must make a Constitution saving throw. On a failed save, it is also poisoned until the end of your next turn."}]}],"miss":[]}]}]},{"name":"Beacon of Hope","level":3,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":true,"somatic":false,"material":"Prerequisite: *Heroism*"},"duration":"1 minute","ritual":false,"description":"This power bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing.","higherlevels":"","concentration":true,"automation":[]},{"name":"Bestow Curse","level":3,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Curse*"},"duration":"1 minute","ritual":false,"description":"You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the power. When you cast this power, choose the nature of the curse from the following options:\n\n-Choose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score.\n-While cursed, the target has disadvantage on attack rolls against you.\n-While cursed, the target must make a Wisdom saving throw at the start of each of its turns. lf it fails, it wastes its action that turn doing nothing.\n-While the target is cursed, your attacks and powers deal an extra 1d8 necrotic damage to the target.\n\nA remove curse power ends this effect. At the DM's option, you may choose an alternative curse effect, but it should be no more powerful than those described above. The DM has final say on such a curse's effect.","higherlevels":"","concentration":true,"automation":[]},{"name":"Danger Sense","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 bonus action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You put your faith in the Force, feeling out the future and seeing whether your actions will lead to fortune or ruin. The DM chooses from the following possible omens:\n\n- **Peace**, for results which are not dangerous\n- **Danger**, for results which are dangerous but perhaps still worth the danger\n- **Ruin**, for results which are certain to end in death or tragedy\n\nThe power doesn't take into account any possible circumstances that might change the outcome, such as the use of additional powers or the loss or gain of a companion.\nIf you use this power two or more times before completing your next long rest, there is a cumulative 25 percent chance for each casting after the first that you get a neutral result regardless of the actual outcome.","higherlevels":"","concentration":false,"automation":[]},{"name":"Dark Shear","level":2,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 bonus action","range":"Self","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 minute","ritual":false,"description":"You create a weapon of imperceptible Force energy that lasts until the power ends. It counts as a simple lightweapon with which you are proficient. It deals 2d6 psychic damage, and has the finesse, light, and thrown properties (range 20/60). When you attack while within dim light or darkness, you have advantage.\nIf you drop the weapon or throw it, it disappears at the end of the turn. While the power lasts, you can use a bonus action to make the weapon reappear in your hand.","higherlevels":"When you cast this power using a 3rd or 4th level force slot, the damage increases by 1d6 (3d6). At 5th or 6th level, the damage increases by 2d6 (4d6). At 7th level or higher, the damage increases by 3d6 (5d6).","concentration":true,"automation":[{"type":"target","meta":[{"type":"roll","dice":"2","name":"dice","higher":{"3":"1","4":"1","5":"2","6":"2","7":"3","8":"3","9":"3"}}],"target":"self","effects":[{"type":"ieffect","meta":[],"name":"Dark Shear","duration":"10","effects":"-attack '{{max(strengthMod,dexterityMod)+proficiencyBonus}}|{dice}d6 + {{max(strengthMod,dexterityMod)}} [psychic]|It deals 2d6  psychic damage, and has the finesse, light, and thrown properties (range 20/60). When you attack while within dim light or darkness, you have advantage.","end":true}]}]},{"name":"Dark Side Tendrils","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self (10-foot radius)","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can't take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect.","higherlevels":"When you cast this power using a power slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"2d6 [necrotic]","name":"damage","higher":{"2":"1d6 [necrotic]","3":"2d6 [necrotic]","4":"3d6 [necrotic]","5":"4d6 [necrotic]","6":"5d6 [necrotic]","7":"6d6 [necrotic]","8":"7d6 [necrotic]","9":"8d6 [necrotic]"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"str","fail":[{"type":"damage","damage":"{damage}"},{"type":"text","meta":[],"text":"Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can't take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect."}],"success":[{"type":"damage","damage":"({damage})/2"},{"type":"text","meta":[],"text":"Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can't take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect."}]}]}]},{"name":"Force Mask","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Mind Trick*"},"duration":"1 hour","ritual":false,"description":"Until the power ends or you use an action to dismiss it, you can disguise yourself through use of the Force in many ways. You can appear to be shorter or taller by about a foot and change the appearance of your body and weight, but you cannot change the basic structure of your body. This effect can include your clothes, weapons, and other belongings on your person.\nThis effect is only visual, so any sort of physical contact will only interact with the real size and shape of you. A creature that uses its action to examine you can identify this effect with a successful Intelligence (Investigation) check against your force save DC. This power has no effect on droids or constructs.","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Repulse","level":3,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self (20-foot radius)","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You release an omnidirectional telekinetic burst. Each creature within 20 feet must make a Dexterity saving throw. On a failed save, a creature takes 8d6 force damage and is pushed back 5 feet. On a successful save, a creature takes half damage and isn't pushed. All small objects that are not worn or carried are also pushed 5 feet back.","higherlevels":"When you cast this power using a force slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"8d6[force]","name":"damage","higher":{"4":"1d6[force]","5":"2d6[force]","6":"3d6[force]","7":"4d6[force]","8":"5d6[force]","9":"6d6[force]"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage}"}],"success":[{"type":"damage","damage":"({damage})/2"}]}]},{"type":"text","meta":[],"text":"Each creature within 20 feet must make a Dexterity saving throw. On a failed save, a creature takes 8d6 force damage and is pushed back 5 feet. On a successful save, a creature takes half damage and isn't pushed. All small objects that are not worn or carried are also pushed 5 feet back."}]},{"name":"Force Throw","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Force Push/Pull*"},"duration":"Instantaneous","ritual":false,"description":"Choose one or more creatures or objects within 60 feet that weigh up to 15 pounds. The object immediately moves 60 feet in a direction of your choice. If the object ends this movement in the air, it immediately falls to the ground. If the object collides with anything during its travel, both the object and the target take 3d8 kinetic damage. If the target is a creature, it must make a Dexterity saving throw. On a failed save, it takes 3d8 kinetic damage, or half as much on a successful one.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, the maximum weight increases by 15 pounds and the damage increases by 1d8 for each slot level above 1st.","concentration":false,"automation":[]},{"name":"Heroism","level":1,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"A willing creature you touch is imbued with bravery. Until the power ends, the creature is immune to being frightened and gains temporary hit points equal to your forcecasting ability modifier at the start of each of its turns. When the power ends, the target loses any remaining temporary hit points from this power.","higherlevels":"When you cast this power using a force slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.","concentration":true,"automation":[]},{"name":"Greater Heal","level":6,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Improved Heal*"},"duration":"Instantaneous","ritual":false,"description":"Choose a creature that you can see within range. A surge of positive energy washes through the creature, causing it to regain 70 hit points. This power also ends blindness, deafness, and any diseases affecting the target. This power has no effect on droids or constructs.","higherlevels":"When you cast this power using a force slot of 7th level or higher, the healing increases by 10 for each slot level above 6th.","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"damage","damage":"-70 [heal]","higher":{"7":"-10 [heal]","8":"-20 [heal]","9":"-30 [heal]"}}]},{"type":"text","meta":[],"text":"A surge of positive energy washes through the creature, causing it to regain 70 hit points."}]},{"name":"Hallucination","level":2,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 minute","ritual":false,"description":"You craft a dangerous illusion in the mind of a creature that you can see within range. The target must make a Wisdom saving throw. On a failed save, you create a phantasmal object, creature, or other visible phenomenon of your choice that is no larger than a 10-foot cube and that is perceivable only to the target for the duration. This power has no effect on droids or constructs.\nThe hallucination includes sound, temperature, and other stimuli, also evident only to the creature.\nThe target can use its action to examine the hallucination with an Intelligence (Investigation) check against your force power save DC. If the check succeeds, the target realizes that the hallucination is an illusion, and the power ends.\nWhile a target is affected by the power, the target treats the hallucination as if it were real. The target rationalizes any illogical outcomes from interacting with the hallucination. For example, a target attempting to walk across a phantasmal bridge that spans a chasm falls once it steps onto the bridge. If the target survives the fall, it still believes that the bridge exists and comes up with some other explanation for its fall - it was pushed, it slipped, or a strong wind might have knocked it off.\nAn affected target is so convinced of the hallucination’s reality that it can even take damage from the illusion. A hallucination created to appear as a creature can attack the target. Similarly, a hallucination created to appear as fire, a pool of acid, or lava can\nburn the target. Each round on your turn, the hallucination can deal 1d6 psychic damage to the target if it is in the hallucination’s area or within 5 feet of the hallucination, provided that the illusion is of a creature or hazard that could logically deal damage, such as by attacking. The target perceives the damage as a type appropriate to the illusion.","higherlevels":"When you cast this power using a force power slot of 3rd level or higher, the range increases by 20 feet, the image dimensions increase by 5 feet, and you can target one additional creature for every two slot levels above 2nd.","concentration":true,"automation":[]},{"name":"Hysteria","level":4,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Hallucination*"},"duration":"1 minute","ritual":false,"description":"You tap into the nightmares of a creature you can see within range and create an illusory manifestation of its deepest fears, visible only to that creature. The target becomes frightened for the duration. At the end of each of the target's turns before the power ends, the target must succeed on a Wisdom saving throw or take 4d10 psychic damage. On a successful save, the power ends. This power has no effect on droids or constructs.","higherlevels":"When you cast this power using a force power slot of 5th level or higher, the damage increases by 1d10 for each slot level above 4th.","concentration":true,"automation":[{"type":"text","meta":[],"text":"The target becomes frightened for the duration. At the end of each of the target's turns before the power ends, the target must succeed on a Wisdom saving throw or take 4d10 psychic damage. On a successful save, the power ends"},{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"wis","fail":[{"type":"damage","damage":"4d10 [psychic]","higher":{"5":"1d10 [psychic]","6":"2d10 [psychic]","7":"3d10 [psychic]","8":"4d10 [psychic]","9":"5d10 [psychic]"}}],"success":[]}]}]},{"name":"Improved Dark Side Tendrils","level":3,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Dark Side Tendrils*"},"duration":"1 minute","ritual":false,"description":"You summon a 20-foot-radius sphere of inky blackness at a point within range. No light, enhanced or otherwise, can illuminate the area, creatures fully within the area are blinded, and the area is difficult terrain.\nAny creature that starts its turn in the area takes 2d6 necrotic damage. Any creature that ends its turn in the area must succeed on a Strength saving throw or take 2d6 poison damage as tendrils of dark energy caress it.","higherlevels":"","concentration":true,"automation":[]},{"name":"Improved Force Barrier","level":5,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"10 minute","range":"30 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"This power further bolsters your allies with toughness and resolve. Choose up to twelve creatures within range. Each target gains the following benefits:\n\n- The creature becomes immune to poison and disease. Any currently existing poison or diseases still exist.\n- The creature becomes immune to being frightened by powers.\n- The creature’s hit point maximum and current hit points increase by 2d10 for the duration.\n\nThese benefits last for 24 hours or until the end of your next long rest, whichever happens first.","higherlevels":"","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"ieffect","meta":[],"name":"Improved Force Barrier","duration":"-1","effects":"-immune poison","end":false}]},{"type":"text","meta":[],"text":"This power further bolsters your allies with toughness and resolve. Choose up to twelve creatures within range. Each target gains the following benefits:\n\n- The creature becomes immune to poison and disease. Any currently existing poison or diseases still exist.\n- The creature becomes immune to being frightened by powers.\n- The creature’s hit point maximum and current hit points increase by 2d10 for the duration.\n\nThese benefits last for 24 hours or until the end of your next long rest, whichever happens first."}]},{"name":"Improved Restoration","level":5,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Restoration*"},"duration":"Instantaneous","ritual":false,"description":"You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target’s exhaustion level by one, or end one of the following effects on the target:\n\n- One effect that charmed the target.\n- One curse, including the target’s attunement to a cursed item.\n- Any reduction to one of the target’s ability scores.\n- One effect reducing the target’s hit point maximum.","higherlevels":"","concentration":false,"automation":[]},{"name":"Mass Animation","level":5,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Animate Weapon*"},"duration":"1 minute","ritual":false,"description":"You snag several objects using the force and whip them into the air around you, controlling them to attack at your command. Choose up to ten unenhanced objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can't control any object larger than Huge. Each object animates and hovers near you, remaining within 100 feet of you for the duration. An animated object behaves as though it is was a construct, with AC, hit points, and attacks determined by its size, and a flying speed of 30 feet.\nAs a bonus action, you can mentally direct any object controlled by this power. If you control multiple objects, you can command any or all of them at the same time. You decide what action the object will take and where it will move. The objects act at the end of your turn. If you command an object to attack, it can make a single melee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and kinetic damage determined by its size.","higherlevels":"If you cast this power using a force slot of 6th level or higher, you can animate two additional objects for each slot level above 5th.","concentration":true,"automation":[]},{"name":"Mass Hysteria","level":9,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Hysteria*"},"duration":"1 minute","ritual":false,"description":"Drawing on the deepest fears of a group of creatures, you create illusory creatures in their minds, manifesting their worst nightmares as an implacable threat visible only to them. Each creature in a 30-foot-radius sphere is frightened for the duration of the power. At the end of each of the frightened creature's turns, it must succeed on a Wisdom saving throw or take 5d10 psychic damage. On a successful save, the power ends for that creature. This power has no effect on droids or constructs.","higherlevels":"","concentration":true,"automation":[]},{"name":"Master Force Barrier","level":8,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Improved Force Barrier*"},"duration":"1 minute","ritual":false,"description":"This power massively bolsters your allies with toughness and resolve. Creatures of your choice in a 30-foot radius around you when you cast this power gain the following benefts:\n\n-The creature sheds dim light in a 5-foot radius.\n-The creature has advantage on all saving throws\n-Other creatures have disadvantage on attack rolls against them.\n-When a dark side creature hits them with a melee attack, that creature must make a Constitution saving throw or be blinded until the power ends.","higherlevels":"","concentration":true,"automation":[]},{"name":"Mind Trap","level":4,"school":"A","classes":"Universal Power","subclasses":"","casttime":"","range":"","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Force Confusion*"},"duration":"","ritual":false,"description":"You attempt to trap the mind of your target in a psychic cage. The target must make a Charisma saving throw. On a failed save, the creature's mind is trapped. It can think, but it can't have any contact with or perceive the outside world. If the creature takes damage, it makes another Charisma save. On a success, the power ends. This power has no effect on droids or constructs.","higherlevels":"When you cast this power using a force slot of 6th level or higher, after 1 minute of concentration the power's duration becomes 24 hours and it no longer requires your concentration.","concentration":true,"automation":[{"type":"target","meta":[],"target":"all","effects":[{"type":"save","meta":[],"stat":"cha","fail":[{"type":"ieffect","meta":[],"name":"Mind Trap","duration":"10","effects":"","end":true},{"type":"text","meta":[],"text":"The creature's mind is trapped. It can think, but it can't have any contact with or perceive the outside world."}],"success":[]}]}]},{"name":"Necrotic Charge","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"5 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 round","ritual":false,"description":"As part of the action used to cast this power, you must make a melee attack with a weapon against one creature within the power's range, otherwise the power fails. On a hit, the target suffers the attack's normal effects, and you can choose to deal up to 1d8 of necrotic damage, which you suffer as well. This damage can’t be reduced or negated in any way.\n","higherlevels":"This power's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 necrotic damage to the target, and you can increase the secondary damage to 2d8. Both damage rolls increase by 1d8 at 11th level and 17th level.","concentration":false,"automation":[{"type":"target","meta":[],"target":"each","effects":[{"type":"damage","damage":"1d8 [necrotic]","cantripScale":true}]}]},{"name":"Psychic Charge","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"5 feet","components":{"verbal":false,"somatic":true,"material":""},"duration":"1 round","ritual":false,"description":"As part of the action used to cast this power, you must make a melee attack with a weapon against one creature within the power's range, otherwise the power fails. On a hit, the target suffers the attack's normal effects, and its mouth is covered by a violet veil until the start of your next turn. If the target willingly speaks before then, it immediately takes 1d8 psychic damage, and the power ends.","higherlevels":"This power's damage increases when you reach\nhigher levels. At 5th level, the melee attack deals an extra 1d8 psychic damage to the target, and the damage the target takes for speaking increases to 2d8. Both damage rolls increase by 1d8 at 11th level and 17th level.","concentration":false,"automation":[]},{"name":"Remove Curse","level":3,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"At your touch, all curses affecting one creature or object end. If the object is a cursed enhanced item, its curse remains, but the power breaks its owner's attunement to the object so it can be removed or discarded.","higherlevels":"","concentration":false,"automation":[]},{"name":"Restoration","level":2,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":true,"material":""},"duration":"Instantaneous","ritual":false,"description":"You touch a creature and end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.","higherlevels":"","concentration":false,"automation":[]},{"name":"Sonic Charge","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"5 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 round","ritual":false,"description":"As part of the action used to cast this power, you must make a melee attack with a weapon against one creature within the power's range, otherwise the power fails. On a hit, the target suffers the attack's normal effects, and you begin to emanate a disturbing hum until the start of your next turn. If a hostile creature ends its turn within 5 feet of you, it takes 1d4 sonic damage.","higherlevels":"This power's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 sonic damage to the target, and the secondary damage increases by 1d4. Both damage rolls increase by 1d8 and 1d4, respectively, at 11th level and 17th level.","concentration":false,"automation":[]},{"name":"Telekinetic Storm","level":3,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Self (15-foot radius)","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Turbulence*"},"duration":"1 minute","ritual":false,"description":"You stir the force around you, creating a turbulent field of telekinetic energy that buffets enemies around you. The field extends out to a distance of 15 feet around you for the duration.\nWhen you cast this power, you can designate any number of creatures you can see to be unaffected by it. An affected creature's speed is halved in the area, and when the creature enters the area for the first time on a turn or starts its turn there, it must make a Constitution saving throw. On a failed save, the creature takes 3d8 force damage. On a successful save, the creature takes half as much damage.","higherlevels":"When you cast this power using a force power slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.","concentration":true,"automation":[]},{"name":"True Sight","level":6,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Force Sight*"},"duration":"1 hour","ritual":false,"description":"You shift your vision to see through use of the Force, giving you the ability to see things as they actually are. For the duration, you have truesight and notice secret doors hidden by powers, all out to a range of 120 feet.","higherlevels":"","concentration":false,"automation":[]},{"name":"Wrack","level":6,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":true,"material":"Prerequisite: *Plague*"},"duration":"Instantaneous","ritual":false,"description":"You wrack the body of a creature that you can see with a virulent, disease-like condition. The target must make a Constitution saving throw. On a failed save, it takes 14d6 necrotic damage, or half as much damage on a successful save. The damage can't reduce the target's hit points below 1. If the target fails the saving throw, its hit point maximum is reduced for 1 hour by an amount equal to the necrotic damage it took. Any effect that removes a disease allows a creature's hit point maximum to return to normal before that time passes.","higherlevels":"If you cast this power using a force slot of 7th level or higher, the power deals an extra 2d6 damage for each slot level above 6th.","concentration":false,"automation":[{"type":"target","meta":[{"type":"roll","dice":"14d6[necrotic]","name":"damage","higher":{"7":"2d6[necrotic]","8":"4d6[necrotic]","9":"6d6[necrotic]"}}],"target":"all","effects":[{"type":"save","meta":[],"stat":"dex","fail":[{"type":"damage","damage":"{damage}"}],"success":[{"type":"damage","damage":"({damage})/2"}]}]},{"type":"text","meta":[],"text":"You wrack the body of a creature that you can see with a virulent, disease-like condition. The target must make a Constitution saving throw. On a failed save, it takes 14d6 necrotic damage, or half as much damage on a successful save. The damage can't reduce the target's hit points below 1. If the target fails the saving throw, its hit point maximum is reduced for 1 hour by an amount equal to the necrotic damage it took. Any effect that removes a disease allows a creature's hit point maximum to return to normal before that time passes."}]},{"name":"Armor of Abeloth","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 hour","ritual":false,"description":"A protective force surrounds you, manifesting as shimmering light that covers you and your gear. You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 psychic damage.","higherlevels":"**Force Potency.** When you cast this power using a force slot of 2nd level or higher, both the temporary hit points and the psychic damage increase by 5 for each slot.","concentration":false,"automation":[]},{"name":"Battle Insight","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"Up to 1 round","ritual":false,"description":"You center your focus on a target within range. Through the Force, you gain a brief insight into the target’s defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this power hasn’t ended.\n\n","higherlevels":"This power benefits additional attacks at higher levels: two attacks at 5th level, three attacks at 11th level, and four attacks at 17th level.","concentration":true,"automation":[]},{"name":"Call Lightning","level":3,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"Up to 10 minutes","ritual":false,"description":"As you align yourself with nature through the Force, a 10-foot tall, 60-foot radius storm cloud cylinder appears, centered on a point you can see within range above you, with you as the center point. The power fails if your location can’t accommodate the cloud’s size or height. When you cast the power, choose a point under the cloud for lightning to strike. Each creature within 5 feet must make a Dexterity save, taking 3d10 lightning damage on a fail and half on a success. While the power persists, you can use your action to call lightning to a point in range again.\n\nIf you’re outdoors and in a storm, the power gives you control of the storm rather than creating a new one. The lightning damage also increases by 1d10.","higherlevels":"**Force Potency.** When you cast this power using a force slot of 4th level or higher, the damage increases by 1d10 for each slot level above 3rd.","concentration":true,"automation":[]},{"name":"Comprehend Speech","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1  action","range":"Self","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 hour","ritual":false,"description":"For the duration, you understand the literal meaning of any spoken language that you hear.","higherlevels":"","concentration":false,"automation":[]},{"name":"Control Pain","level":5,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Force Body*"},"duration":"Up to 1 minute","ritual":false,"description":"You use the Force to push your body beyond its normal limits. You can’t die from damage or from failed death saving throws while this power is in effect, but the effort taxes you. If you have 0 hit points while you are under the effect of this power, you do not fall unconscious, and continue acting and fighting normally. While you remain at 0 hit points, you must make a death saving throw at the start of each of your turns. Each time you fail a death saving throw, you suffer a cumulative -1 penalty to attack rolls, ability checks, and saving throws (including death saving throws). This penalty lasts until you regain hit points. Successful death saving throws have no effect, but a natural 20 restores 1 hit point as usual.\n\nIf you have 0 hit points when this power ends, you die instantly.\n","higherlevels":"","concentration":true,"automation":[]},{"name":"Dark Aura","level":3,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 bonus action","range":"Self","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Hex*"},"duration":"Up to 1 minute","ritual":false,"description":"You manifest a mantle of malevolent dark side energy for the duration.\n\nUntil the power ends, any attack you make deals an extra 1d8 necrotic damage when you hit a creature within 10 feet of you. Any creature that takes this damage can’t regain hit points until the start of your next turn.\n\nAdditionally, any creature of your choice that you can see that starts its turn within 10 feet of you gains 1 slowed level until the start of your next turn.","higherlevels":"**Force Potency.** When you cast this power using a force slot of 4th level or higher, the extra damage increases by 1d8 for each slot level above 3rd.","concentration":true,"automation":[]},{"name":"Dominate Mind","level":5,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Dominate Beast*"},"duration":"Up to 1 minute","ritual":false,"description":"You attempt to beguile a humanoid that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.\n\nWhile the target is charmed, you have a telepathic link with it as long as you are within 1 mile of it. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Attack that creature,” “Run over there,” or “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability.\n\nYou can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.\n\nEach time the target takes damage, it makes a new Wisdom saving throw against the power. If the saving throw succeeds, the power ends.","higherlevels":"**Force Potency.** When you cast this power using a 6th-level force slot, the duration is 10 minutes. When you use a 7th-level force slot, the duration is 1 hour. When you use a force slot of 8th level or higher, the duration is 8 hours.","concentration":true,"automation":[]},{"name":"Dun Moch","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 bonus action","range":"30  feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"Up to 1 minute","ritual":false,"description":"You attempt to manipulate a creature into fighting you. One creature that you can see within range must make a Wisdom saving throw. On a failed save, the creature is drawn to you, compelled by your demands. For the duration, it has disadvantage on attack rolls against creatures other than you, and must make a Wisdom saving throw each time it attempts to move to a space that is more than 30 feet away from you; if it succeeds on this saving throw, this power doesn’t restrict the target’s movement for that turn.\n\nThe power ends if you attack any other creature, if you cast a power that targets a hostile creature other than the target, if a creature friendly to you damages the target or casts a harmful power on it, or if you end your turn more than 30 feet away from the target. This power has no effect on droids or constructs.\n","higherlevels":"","concentration":true,"automation":[]},{"name":"Force Blur","level":2,"school":"A","classes":"Universal Action","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Force Mask*"},"duration":"Up to 1 minute","ritual":false,"description":"You use the Force to weave an illusion that blurs your form, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn’t rely on sight, as with blindsight, or can see through illusions, as with truesight.","higherlevels":"","concentration":true,"automation":[]},{"name":"Force Concealment","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":false,"material":""},"duration":"24 hours","ritual":false,"description":"You shroud or alter the aura of a creature or object you touch so that Force powers reveal false information about it. The target can be a willing creature or an object that isn’t being carried or worn by another creature.\n\nWhen you cast the power, choose one or both of the following effects. The effect lasts for the duration. If you cast this power on the same creature or object every day for 30 days, placing the same effect on it each time, the effect lasts until it is dispelled.\n\n**False Aura.** You change the way the target appears to powers and Force-based enhanced effects, such as sense force, that detects the presence of the Force. You can make a Force-based unenhanced object or creature appear enhanced and to radiate a Force aura, or a Force-based enhanced object or creature appear unenhanced and to radiate no Force aura. When you use this effect on an object, you can make the false aura apparent to any creature that handles the item.\n\n**Cloak.** You can change the way the target’s affinity in the Force appears to the force sight power. For example, a Sith Lord with great power in the dark side of the Force can appear instead to have very little strength in the Force, with an affinity towards the light side.\n","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Focus","level":1,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 bonus action","range":"Self","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Force Technique*"},"duration":"Up to 1 minute","ritual":false,"description":"You let the Force guide you, empowering your strikes. Until the power ends, your weapon attacks deal an extra 1d4 force damage on a hit.","higherlevels":"","concentration":true,"automation":[]},{"name":"Force Imbuement","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 bonus action","range":"Touch","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"The crystal inside of a simple lightweapon or the material of a simple vibroweapon or an improvised weapon you are holding is imbued with the power of the Force. For the duration, you can use your forcecasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon’s damage die becomes a d8. The weapon also becomes enhanced, if it isn’t already, and you become proficient with it, if you aren’t already. The power ends if you cast it again or if you let go of the weapon.","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Leap","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 bonus action","range":"Self","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 round","ritual":false,"description":"Until the end of your next turn, you can use your forcecasting ability score instead of your Strength score when you jump, and always count as having made a running start before jumping.","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Meld","level":5,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Force Whisper*"},"duration":"1 hour","ritual":false,"description":"You forge a telepathic link among up to eight willing creatures of your choice within range, psychically linking each creature to all the others for the duration. Droids, constructs, and creatures with Intelligence scores of 2 or less aren’t affected by this power.\n\nUntil the power ends, the targets can communicate telepathically through the bond whether or not they have a common language. The communication is possible over any distance, though it can’t extend beyond a single planet.\n","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Propel","level":1,"school":"A","classes":"","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Force Push/Pull*"},"duration":"Instantaneous","ritual":false,"description":"Choose one or more creatures or objects not being worn or carried within 60 feet that weigh up to a combined total of 15 pounds. The creatures or objects immediately move 60 feet in a direction of your choice. If the creatures or objects end this movement in the air, they immediately fall to the ground. If the creatures or objects collide with any one target during its travel, both the creatures or objects and the target take 3d8 kinetic damage. If the target is a creature, it must make a Dexterity saving throw. On a failed save, it takes 3d8 kinetic damage, or half as much on a successful one.\n\n\n","higherlevels":"**Force Potency.** When you cast this power using a force slot of 2nd level or higher, the maximum weight increases by 15 pounds and the damage increases by 1d8 for each slot level above 1st.","concentration":false,"automation":[]},{"name":"Force Reflect","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 reaction, which you take in response to being hit by a ranged attack","range":"Self","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Saber Reflect*"},"duration":"Instantaneous","ritual":false,"description":"In response to being attacked, you attempt to deflect the attack with the Force. When you use this power, the damage you take from the attack is reduced by 1d10. If you reduce the damage to 0 and the damage is energy, force, ion, kinetic, lightning, necrotic, or sonic, you can reflect the attack at a target within range as part of the same reaction. Make a ranged force attack at a target you can see. The attack has a normal range of 30 feet and a long range of 90 feet. On a hit, the target takes the triggering attack’s normal damage.\n\n\n","higherlevels":"**Force Potency.** When you cast this power using a force slot of 2nd level or higher, the damage reduction increases by 1d10 for each slot level above 1st.","concentration":false,"automation":[]},{"name":"Force Shunt","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You use the Force to thrust a creature you can see to the ground. The target must make a Strength saving throw. On a failed save, a creature takes 1d4 kinetic damage and falls prone.\n\n\n","higherlevels":"This power’s damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).","concentration":false,"automation":[]},{"name":"Force Vision","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 minute","range":"60 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 hour","ritual":false,"description":"You receive a vision of the future through the Force, giving you or one willing creature you can see within range a chance to change fate. When the chosen creature makes an ability check, an attack roll, or a saving throw before the power ends, it can dismiss this power on itself to roll an additional d20 and choose which of the d20s to use. Alternatively, when an attack roll is made against the chosen creature, it can dismiss this power on itself to roll a d20 and choose which of the d20s to use, the one it rolled or the one the attacker rolled.\n\nIf the original d20 roll has advantage or disadvantage, the creature rolls the additional d20 after advantage or disadvantage has been applied to the original roll.\n\n","higherlevels":"**Force Potency.** When you cast this power using a force slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.\n","concentration":false,"automation":[]},{"name":"Force Weapon","level":3,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 bonus action","range":"Touch","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Force Imbuement*"},"duration":"Up to 1 hour","ritual":false,"description":"You touch an unenhanced weapon with which you are proficient. While you wield it for the duration, that weapon becomes an enhanced weapon with a +1 bonus to attack rolls and damage rolls. Additionally, you can use your forcecasting modifier instead of your Strength or Dexterity modifier for attacks and damage rolls when attacking with that weapon.\n\n","higherlevels":"**Force Potency.** When you cast this power using a force slot of 5th level or higher, the bonus increases to +2. When you use a force slot of 7th level or higher, the bonus increases to +3.\n","concentration":true,"automation":[]},{"name":"Force Whisper","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"120 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 round","ritual":false,"description":"You use the Force to carry a message in your voice to another creature within range. The target (and only the target) hears the message and can reply in a whisper that only you can hear.\n\nYou can cast this power through solid objects if you are familiar with the target and know it is beyond the barrier. An enhanced silence effect, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the power. The power doesn’t have to follow a straight line and can travel freely around corners or through openings.\n","higherlevels":"","concentration":false,"automation":[]},{"name":"Greater Saber Throw","level":5,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Improved Saber Throw*"},"duration":"Instantaneous","ritual":false,"description":"As a part of the action used to cast this power, you must make a ranged force attack with a lightweapon or vibroweapon against one target within the power’s range, otherwise the power fails. On a hit, the target takes 6d8 damage of the same type as the weapon’s damage and must make a Constitution saving throw against an additional effect depending on your choice of casting ability:\n\n**Wisdom.** The target takes an additional 4d6 force damage and it gains four levels of slowed until the end of its next turn. On a success, the target takes half as much damage and its speed isn’t reduced.\n\n**Charisma.** The target takes an additional 4d6 necrotic damage and cannot regain hit points until the end of its next turn. On a success, the target takes half as much damage and its healing capability is unaffected.\n\nThe weapon then immediately returns to your hand.\n\n","higherlevels":"\n**Force Potency.** When you cast this power using a force slot of 6th level or higher, the force or necrotic damage increases by 1d6 for each slot above 5th.","concentration":false,"automation":[]},{"name":"Improved Saber Throw","level":2,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action ","range":"60 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Saber Throw*"},"duration":"Instantaneous","ritual":false,"description":"As a part of the action used to cast this power, you must make a ranged force attack with a lightweapon or vibroweapon against one target within the power’s range, otherwise the power fails.\n\nOn a hit, the target takes 2d8 damage of the same type as the weapon’s damage and must make a Constitution saving throw. On a failed save, the target gains 1 slowed level until the end of its next turn and the weapon then immediately returns to your hand. The next attack made against the target that hits it before the end of the target’s next turn deals an additional 1d10 force damage. On a successful save, the target takes half as much additional force damage on the next attack that hits it, and suffers no additional effect.\n\n\n","higherlevels":"**Force Potency.** When you cast this power using a force slot of 3rd level or higher, the force damage increases by 1d10 for each slot level above 2nd.","concentration":false,"automation":[]},{"name":"Malacia","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Mind Trick*"},"duration":"Up to 1 minute","ritual":false,"description":"A creature of your choice that you can see within range is overcome with a sense of dizziness and nausea, as you disturb its equilibrium with the Force. The creature must make a Wisdom saving throw or fall prone, becoming incapacitated and unable to stand up for the duration.\n\nAt the end of each of its turns, and each time it takes damage, the target can make another Wisdom saving throw. The target has advantage on the saving throw if it’s triggered by damage. On a success, the power ends. This power has no effect on droids or constructs.\n","higherlevels":"","concentration":true,"automation":[]},{"name":"Mass Coerce Mind","level":6,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Coerce Mind*"},"duration":"24 hours","ritual":false,"description":"You suggest a course of activity (limited to a sentence or two) and influence with the Force up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to harm itself automatically negates the effect of the power.\n\nEach target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the power ends when the subject finishes what it was asked to do.\n\nYou can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a group of soldiers give all their money to the first beggar they meet. If the condition isn’t met before the power ends, the activity isn’t performed. If you or any of your companions damage a creature affected by this power, the power ends for that creature. This power has no effect on droids or constructs.","higherlevels":"**Force Potency.** When you cast this power using a 7th-level force slot, the duration is 10 days. When you use an 8th-level force slot, the duration is 30 days. When you use a 9th-level force slot, the duration is a year and a day.","concentration":false,"automation":[]},{"name":"Mass Malacia","level":3,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"120 feet (30-foot cube)","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Malacia*"},"duration":"Up to 1 minute","ritual":false,"description":"Each creature in a 30-foot cube within range must make a Wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this power, the creature is incapacitated and has a speed of 0.\n\nThe power ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor. This power has no effect on droids or constructs.\n","higherlevels":"","concentration":true,"automation":[]},{"name":"Master Malacia","level":6,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Mass Malacia*"},"duration":"Up to 1 minute","ritual":false,"description":"Choose one creature that you can see within range. The creature reels with extreme dizziness and nausea for the duration. Creatures that can’t be charmed are immune to this power.\n\nThe affected creature must use all of its movement to writhe in discomfort without leaving its space and has disadvantage on Dexterity saving throws and attack rolls. While the target is affected by this power, other creatures have advantage on attack rolls against it. As an action, an affected creature makes a Wisdom saving throw to regain control of itself. On a successful save, the power ends. This power has no effect on droids or constructs.\n","higherlevels":"","concentration":true,"automation":[]},{"name":"Master Saber Throw","level":7,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self (90-foot line)","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Greater Saber Throw*"},"duration":"Instantaneous","ritual":false,"description":"When you cast this power, you must be wielding at least one lightweapon or vibroweapon, otherwise the power fails. When you cast this power, you can throw two weapons, striking creatures in two lines originating from yourself, both 90 feet long and 5 feet wide, or you can throw one weapon in a 90-foot long, 5-foot wide line of your choice originating from yourself and change its direction to move in a second identical line of your choice within range. Each creature in a line must make a Dexterity saving throw. A creature takes 5d8 damage of the same type as the weapon’s damage and 5d8 force damage on a failed save, or half as much damage on a successful one. A creature in the area of more than one line is affected only once. The weapons then immediately return to your hand.\n\n","higherlevels":"**Force Potency.** When you cast this power using a force slot of 8th level or higher, the weapon damage and force damage each increase by 1d8 for each slot level above 7th.\n","concentration":false,"automation":[]},{"name":"Morichro","level":3,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Cloud Mind*"},"duration":"1 hour","ritual":false,"description":"You touch a willing creature and put it into a cataleptic state that is indistinguishable from death.\n\nFor the power’s duration, or until you use an action to touch the target and dismiss the power, the target appears dead to all outward inspection and to powers used to determine the target’s status. The target is blinded and incapacitated, and its speed drops to 0. The target has resistance to all damage except psychic damage. If the target is diseased or poisoned when you cast the power, or becomes diseased or poisoned while under the power’s effect, the disease and poison have no effect until the power ends. This power has no effect on droids or constructs.\n","higherlevels":"","concentration":false,"automation":[]},{"name":"Necrotic Touch","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":false,"material":""},"duration":"","ritual":false,"description":"You attempt to drain the essence from a creature. Make a melee force attack against the target. If the attack hits, the creature takes 1d6 necrotic damage, and you gain temporary hit points equal to the damage dealt until the end of your next turn.\n\n","higherlevels":"This power’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\n","concentration":false,"automation":[]},{"name":"Psychometry","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 minute","range":"Self","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Telemetry*"},"duration":"10 minutes","ritual":false,"description":"For the duration, you gain the ability to “communicate” telepathically with inanimate objects you touch. You can ask up to five questions and receive answers from objects, usually in the form of a auditory or visual hallucination. For example, touching the rusted, broken remains of a lightsaber and asking how it got there may result in a brief vision of a disgruntled Jedi Knight casting it to the ground on that spot. An object “questioned” in this way can only provide information relating to its past. The DM has the final say on what objects can be questioned, and to what extent.","higherlevels":"","concentration":false,"automation":[]},{"name":"Rebuke","level":0,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You strike a creature with the righteous fury of the Force. Make a melee force attack against the target, if the attack hits, the target takes force damage depending on its alignment: a dark-aligned creature takes 1d12 force damage, a balanced creature takes 1d10 force damage, and a light-aligned creature takes 1d8 force damage.\n\n","higherlevels":"The power’s damage increases by one die when you reach 5th, 11th, and 17th level.\n","concentration":false,"automation":[]},{"name":"Seethe","level":0,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You seethe with anger, letting the dark side of the Force flow through and empower you. As part of the action to cast this power, you spend one of your Hit Dice to recover hit points.","higherlevels":"","concentration":false,"automation":[]},{"name":"Shadow Sight","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 hour","ritual":false,"description":"You enhance your eyesight with the Force, allowing you to better see in the dark. For the duration, you have darkvision out to 60 feet.","higherlevels":"","concentration":false,"automation":[]},{"name":"Sound Trick","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 minute","ritual":false,"description":"You use the Force to produce an effect within range. You create one of the following special effects within range:\n\n- Your voice booms up to three times as loud as normal, and you can alter its tone, for 1 minute.\n- You cause harmless tremors in the ground for 1 minute.\n- You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a bird, or ominous whispers.\n- You gain the ability to speak like another species for 1 minute, allowing you to speak in a language you know but otherwise lack the physical ability to speak, such as a Wookiee speaking Basic.\n- You create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, a billowing of someone’s clothes, or a flickering of unenhanced light fixtures within range.\n\nA wary creature can use its action to make an Intelligence (Investigation) check against your force save DC, discerning that the effects are illusory on a success.\n\nIf you cast this power multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action.\n","higherlevels":"","concentration":false,"automation":[]},{"name":"Spirit Blade","level":0,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Touch","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You conjure a blade of spirit energy and attempt to strike one creature. Make a melee force attack against the target. If the attack hits, the creature takes 1d10 necrotic damage.\n\n","higherlevels":"This power can make multiple attacks at higher levels: two attacks at 5th level, three attacks at 11th level, and four attacks at 17th level. Each attack can target the same creature or different ones. Make a separate attack roll for each target.\n","concentration":false,"automation":[]},{"name":"Sustained Lightning","level":1,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"30 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Shock*"},"duration":"Up to 1 minute","ritual":false,"description":"You lash out against a creature within range with continual jolts of Force lightning. Make a ranged force attack against that creature. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 1d12 lightning damage to the target automatically. The power ends if you use your action to do anything else. The power also ends if the target is ever outside the power’s range or if it has total cover from you.\n\n","higherlevels":"\n**Force Potency.** When you cast this power using a force slot of 2nd level or higher, the initial damage increases by 1d12 for each slot level above 1st.","concentration":true,"automation":[]},{"name":"Telekinetic Shield","level":3,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Animate Weapon*"},"duration":"Up to 1 minute","ritual":false,"description":"You lift three piles of debris or small objects from the ground and interpose them between you and your opponents for the duration.\n\nWhile at least three piles remain, you have three-quarters cover. While two piles remain, you have half cover. While only one pile remains, you have one-quarter cover. The piles don’t hinder your attacks. When you cast the power, or as an action on a subsequent turn, you can direct up to two piles to attack up to two creatures you can see within 30 feet. Make a ranged force attack roll for each pile. On a hit, a creature takes 2d6 kinetic plus 1d10 force damage. The pile is destroyed whether it hits or misses.\n\n","higherlevels":"\n**Force Potency.** If you cast this power with a force slot of 4th level or higher, the power creates one additional pile for each level above 3rd.","concentration":true,"automation":[]},{"name":"Telemetry","level":1,"school":"A","classes":"Universal Power","subclasses":"","casttime":"1 minute","range":"Touch","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You choose one object that you must touch throughout the casting of the power. If it is an enhanced or modified item, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any powers are affecting the item and what they are.\n\nIf the item was created by a power, you learn which power created it. If you instead touch a creature throughout the casting, you learn what force powers, if any, are currently affecting it.\n","higherlevels":"","concentration":false,"automation":[]},{"name":"Will of the Force","level":9,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Self","components":{"verbal":false,"somatic":false,"material":""},"duration":"Instantaneous","ritual":false,"description":"You sublimate yourself before the will of the Force, attempting to use it to affect change in the galaxy around you.\n\nThe basic use of this power is to duplicate any other light side or universal force power of 8th level or lower. You don’t need to meet any requirements in that power; it simply takes effect. Alternatively, you can create one of the following effects of your choice:\n\n- You summon one object to you of up to 250,000 cr in value that isn’t an enhanced item. The object can be no more than 300 feet in any dimension, and it appears in an unoccupied space you can see on the ground.\n- You allow up to twenty creatures that you can see to regain all hit points, and you end all effects on them described in the improved restoration power.\n- You grant up to ten creatures that you can see resistance to a damage type you choose.\n- You grant up to ten creatures you can see immunity to a single power or other specific enhanced effect for 8 hours. For instance, you could make yourself and all your companions immune to the Manifestation of Abeloth’s Will ability.\n- You undo a single recent event by forcing a reroll of any roll made within the last round (including your last turn). Reality reshapes itself to accommodate the new result. For example, will of the force could undo an opponent’s successful save, a foe’s critical hit, or a friend’s failed save. You can force the reroll to be made with advantage or disadvantage, and you can choose whether to use the reroll or the original roll.\n\nYou might be able to achieve something beyond the scope of the above examples. State your wish to the DM as precisely as possible. The DM has great latitude in ruling what occurs in such an instance; the greater the wish, the greater the likelihood that something goes wrong. This power might simply fail, the effect you desire might only be partly achieved, or you might suffer some unforeseen consequence as a result of how you worded the wish. For example, wishing that a villain were dead might propel you forward in time to a period when that villain is no longer alive, effectively removing you from the game. Similarly, wishing for a legendary enhanced item or artifact might instantly transport you to the presence of the item’s current owner.\n\nThe stress of casting this power to produce any effect other than duplicating another power weakens you. After enduring that stress, each time you cast a power until you finish a long rest, you take 1d10 necrotic damage per level of that power, which can’t be reduced or prevented in any way. Additionally, your Strength drops to 3, if it isn’t 3 or lower already, for 2d4 days. For each of those days that you spend resting and doing nothing more than light activity, your remaining recovery time decreases by 2 days. Additionally, there is a 33 percent chance that you are unable to cast will of the force ever again if you suffer this stress. Finally, if you are reduced to 0 hit points as a result of this necrotic damage, or at any point before you have fully recovered from the Strength reduction, you immediately die and cannot be resurrected as your body fades away, absorbed into the living Force.\n","higherlevels":"","concentration":false,"automation":[]},{"name":"Force Blinding","level":1,"school":"A","classes":"Light Side Power","subclasses":"","casttime":"1 action","range":"Self (15-foot cone)","components":{"verbal":false,"somatic":false,"material":""},"duration":"1 round","ritual":false,"description":"You use the Force to emit a blinding flash of light from your hand. Roll 6d10, the total is how many hit points of creatures this power can effect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can’t see).\n\nStarting with the creature that has the lowest current hit points, each creature affected by this power is blinded until the power ends. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for the creature to be affected.\n\n\n","higherlevels":"**Force Potency.** When you cast this power using a force slot of 2nd level or higher, roll an additional 2d10 for each slot level above 1st.","concentration":false,"automation":[]},{"name":"Mind Prison","level":6,"school":"A","classes":"Dark Side Power","subclasses":"","casttime":"1 action","range":"60 feet","components":{"verbal":false,"somatic":false,"material":"Prerequisite: *Mind Trap*"},"duration":"Up to 1 minute","ritual":false,"description":"You attempt to bind a creature within an illusory cell that only it perceives. One creature you can see within range must make an Intelligence saving throw. The target succeeds automatically if it is immune to being charmed. On a successful save, the target takes 5d10 psychic damage, and the power ends. On a failed save, the target takes 5d10 psychic damage, and you make the area immediately around the target’s space appear dangerous to it in some way. You might cause the target to perceive itself as being surrounded by fire, a storm of blaster-fire, or deadly toxic gas, for example. Whatever form the illusion takes, the target can’t see or hear anything beyond it and is restrained for the power’s duration. If the target is moved out of the illusion, makes a melee attack through it, or reaches any part of its body through it, the target takes 10d10 psychic damage, and the power ends. This power has no effect on droids or constructs.","higherlevels":"","concentration":true,"automation":[]}]
